using System.Text;

namespace Nodes.Utils
{
    /// <summary>
    /// 对汉字的一些除了
    /// </summary>
    public class PinYin
    {
        #region 汉字数组
        private static string[][] HanziArray =
           new string[][]
           {
                new string[]{"A","阿啊锕呵吖腌錒嗄"},
                new string[]{"Ai","埃哎唉哀挨锿嗳捱欸溾鎄娭噯癌皑磑硙皚溰敳敱隑嵦娾騃嘊啀凒矮霭蔼毐藹絠譪躷濭昹靄爱艾碍隘暧瑷嫒嗌砹乂薆礙硋譺瞹皧賹璦焥醷曖鑀閡懝懓愛阨阸靉嬡餲馤壒塧堨呝叆鴱僾伌"},
                new string[]{"An","安庵氨谙鞍桉鹌盦蓭葊萻菴腤裺誝諳盫痷闇廣鞌韽峖媕馣啽鮟鵪鶕侒俺铵埯揞罯碪銨晻隌垵唵按案岸暗胺黯犴荌豻貋洝錌頇頞屽婩堓垾咹厈儑"},
                new string[]{"Ang","肮醃骯昂枊岇卬盎醠"},
                new string[]{"Ao","凹熬爊熝軪梎柪鴢敖鳌翱螯嗷鏖聱遨嚣獒廒璈蔜翺翶磝謷獓滶摮慠隞嶅囂嚻嗸鰲厫鷔鼇袄媪拗芺蝹襖抝镺媼奥澳傲坳岙鏊懊骜謸擙扷嶴岰嫯奧奡墺驁垇"},
                new string[]{"Ba","八巴扒叭芭岜疤笆粑捌吧罢钯鲃蚆羓罷紦豝玐釛釟鈀柭朳峇夿哵仈丷拔跋茇魃菝胈詙癹犮炦軷颰妭墢坺叐鼥把靶坝霸爸灞耙鲅鲌覇矲跁欛弝壩垻鮁鮊"},
                new string[]{"Bai","掰挀白百摆柏佰伯捭襬絔粨竡栢擺败拜稗呗薭粺贁猈敗拝韛唄"},
                new string[]{"Ban","班般搬扳斑颁瘢癍螌肦褩籓辬朌斒攽頒鳻版板坂阪钣舨蝂覂粄瓪鈑昄闆岅魬办半伴拌瓣绊扮靽絆秚跘湴辦鉡柈怑姅埿坢"},
                new string[]{"Bang","邦帮浜梆縍濱邫捠鞤幫幚幇崗垹榜绑膀綁紡牓髈棒傍镑磅蚌谤蒡搒蚄蛖蜯艕稖謗硥玤棓鎊挷徬塝埲"},
                new string[]{"Bao","包胞剥褒苞孢煲炮龅勹蕔裦襃笣枹闁鮑剝佨齙薄雹窇鉋铇宝保堡饱葆褓鸨宀藵緥賲珤怉靌寶寳寚宲飹飽媬駂堢鳵鴇报抱鲍爆暴豹瀑刨曝趵菢虣蚫袌曓鑤忁靤報骲髱勽儤"},
                new string[]{"Bei","杯碑悲卑陂背鹎椑藣襬箄盃桮柸揹鵯北鉳被倍贝备辈蓓悖钡碚焙狈孛惫褙邶鞴鐾鞁萯蛽苝糒誖禙貝琲珼狽犕牬軰輩鄁棑梖杮鋇昁鐴憊愂韝垻骳僃備偹偝俻呗臂唄"},
                new string[]{"Ben","奔贲锛蟦賁犇渀逩泍錛鐼喯倴本苯畚翉楍奙笨坌夯獖燌炃輽桳撪捹"},
                new string[]{"Beng","崩绷嘣繃綳絣祊痭挷閍嵭奟傰伻甭琫菶琣鞛埲埄泵蹦迸蚌甏镚跰逬錋揼鏰塴"},
                new string[]{"Bi","逼鲾螕豍皀毴榌楅鎞屄鰏鵖偪鼻荸比笔彼俾鄙吡秕匕妣舭沘聛粃筆貏疕柀朼崥娝夶啚佊必币碧毕壁避闭臂璧弊弼蔽庇毙痹敝铋荜薜哔襞陛毖辟婢篦筚濞蓖裨滗髀跸秘拂泌愎萆箅嬖狴畀庳贲觱诐赑鞁蓽蘗萞蜌苾腷胇肸袐翍罼襅襣繴縪綼紴粊篳箆詖笓稫禆皕貱痺賁疪畢畐畁贔珌獙獘踾蹕躃躄熚煏潷滭湢邲鄨鄪梐鉍柲枈旇斃鏎鐴閇閈閉閟愊闬怶怭彃弻廦鞞鞸幤幣韠飶饆妼馝奰駜壀堛驆坒髲嗶魓鮅鮩咇鴓鶝鷝鷩鸊鼊佖"},
                new string[]{"Bian","边编鞭砭煸鳊蝙笾萹臱編糄籩箯獱猵牑邉邊鍽揙鞕鯾鯿匾贬扁褊碥窆藊覵稨豍貶疺釆惼鴘便变遍辨辩卞辫汴苄忭弁缏抃艑覍緶變玣辡辧辮辯邲汳昪閞徧頨変"},
                new string[]{"Biao","标彪飚飙镖膘骠髟镳瘭飑杓灬摽瀌藨蔈臕膔脿穮磦謤贆猋爂熛滮淲標鏢鑣幖颮颷飆飇飈飊墂驃驫骉麃儦表裱婊褾諘檦錶鳔俵鰾"},
                new string[]{"Bie","憋鳖瘪虌蟞癟鱉鼈龞别蹩莂蛂苾襒柲徶咇別彆"},
                new string[]{"Bin","斌宾彬滨槟濒镔缤傧豳玢赟虨繽訜豩賓賔贇璸瑸瀕濵濱邠汃檳椕鑌霦顮儐殡膑鬓摈髌臏殯擯髕髩鬂鬢"},
                new string[]{"Bing","兵冰屏并槟栟絣氷檳梹掤幷仒仌炳丙秉柄禀邴饼蛃苪綆窉稟眪癝癛琕鈵棅鉼昺昞抦陃怲庰鞞鞸屛寎餅餠偋病摒疒誁竝栤靐鮩傡倂併並"},
                new string[]{"Bo","波拨播玻剥钵菠般饽趵嶓袚袯缽襏紴磻碆砵盋發癶蹳潑溊鉢撥餑妭驋鮁哱鱍剝僠伯博搏勃泊柏驳薄脖亳铂箔渤舶帛钹膊魄礴鹁踣孛镈僰浡茀鲌葧萡苩艊胉肑袹襮簙詙秡礡豰瓟瓝猼狛犻犦牔煿湐淿郣欂鈸桲鉑柭鋍鎛挬鑮懪愽彴帗餺馎馛馞駁駮壆髆髉嚗鮊鵓侼仢跛簸蚾箥擘檗掰蔢蘗襎糪譒檘孹卜啵蔔噃"},
                new string[]{"Bu","逋晡钸誧秿鈽陠庯巭峬餔鵏不醭輹轐补捕哺卟補獛撲鳪鸔部布步簿埠钚怖埔瓿蔀荹篰箁踄郶歩歨鈈柨捗抪悑廍尃餢婄埗咘吥勏佈"},
                new string[]{"Ca","擦拆嚓攃礤礸"},
                new string[]{"Cai","猜偲揌啋才财材裁纔財采彩踩睬綵跴毝採寀婇埰倸菜蔡縩棌"},
                new string[]{"Can","参餐骖鲹爘湌嵾飡飱嬠驂喰鯵鰺叅參傪残蚕惭蝅蠶蠺蹔殘摲慚慙嬱惨黪朁憯慘黲灿璨粲掺孱薒謲燦澯摻嘇儏"},
                new string[]{"Cang","仓舱苍沧伧蒼艙螥篬獊濸滄嵢鶬凔鸧傖倉仺藏蔵鑶匨"},
                new string[]{"Cao","操糙撡曹槽嘈漕艚螬蓸褿曺鏪慒嶆傮草艹屮艸懆慅愺騲"},
                new string[]{"Ce","册策测侧厕恻蓛萴萗荝粣簎箣筴筞笧畟測敇拺憡惻廁墄厠冊側齰"},
                new string[]{"Cen","参嵾參岑涔笒硶梣"},
                new string[]{"Ceng","噌曾层竲橧曽嶒層驓蹭"},
                new string[]{"Cha","插差叉嚓杈喳碴锸馇荖芆艖臿肞訍釵銟鍤鎈揷捈挿扱扠餷嗏偛查茶察茬搽槎猹檫楂垞嵖褨詧秅梌査摖靫衩镲蹅鑔岔汊刹姹诧紁詫岎奼剎侘仛"},
                new string[]{"Chai","拆差钗疀釵扠柴豺侪祡犲喍儕齜茝虿瘥蠆袃訍囆"},
                new string[]{"Chan","掺搀觇脠袩裧襜襝覘辿梴鉆鋓攙摻幨嚵佔禅蝉馋蟾婵潺谗孱澶廛缠崭镡躔巉瀍镵苂艬螹蟬襌纒纏繵繟緾誗禪磛讒獑煘瀺潹湹鄽酁毚欃棎鋋鑱嶄嶃嬋饞壥單劖儳儃僤僝产铲谄阐冁蒇骣啴浐蕆簅諂譂讇産產燀灛滻醦榐旵斺摌鏟閳闡幝嵼墠囅嘽剷剗刬丳颤忏羼韂硟讖摲懺懴顫"},
                new string[]{"Chang","昌娼菖鲳伥猖阊裮琩淐晿錩锠閶闛鯧倀鼚常尝肠偿苌场倘裳徜嫦萇蟐膓腸脹甞瓺瑺棖鋿鏛長镸塲場嚐嘗鱨鲿兏償仩仧厂敞昶惝氅鋹廠厰僘唱畅倡怅鬯玚誯畼瑒焻暢悵韔"},
                new string[]{"Chao","超抄钞焯绰剿吵怊繛綽綤訬欩樔鈔摷弨勦劋朝潮巢嘲晁罺窲謿牊漅轈鄛巣鼂鼌炒粆眧趫煼焣巐麨耖觘趠仯仦"},
                new string[]{"Che","车砗莗蛼硨車唓俥伡扯尺撦奲偖伬撤彻掣澈坼屮聅詀謵硩瞮爡焎烲烢迠揊徹頙呫勶"},
                new string[]{"Chen","琛抻嗔郴縝綝諃謓瞋瘨賝棽捵陈臣晨沉尘辰宸忱谌薼蔯莐莀茞螴訦諶瘎煁軙迧樄鈂桭栕曟敐揨愖陳霃塵鷐麎碜磣硶贂趻踸醦鍖夦墋趁衬谶称秤龀榇疢襯稱讖趂櫬闖嚫儭齓齔伧傖"},
                new string[]{"Cheng","称撑蛏秤瞠柽铛噌牚琤赪虰蟶罉緽竀穪稱赬瑲爯浾泟檉橖橕槍棦鎗撐摚鏳鏿鐣鐺憆阷靗頳饓偁成城程乘承诚呈澄橙丞惩埕塍铖酲枨裎晟宬荿脭脀絾筬誠窚碀畻珹珵瀞瀓澂溗浧洆郕氶檙椉棖朾鋮掁挰懲憕峸娍塖堘騬鯎倀乗逞骋睈悜徎庱騁侱"},
                new string[]{"Chi","吃痴哧蚩嗤笞眵螭鸱魑媸郗瓻蚳脪胵絺粚訵誺瞝癡殦樆攡摴摛彲彨妛噄喫鴟鵄麶黐侙齝持迟池驰篪弛茌墀匙踟坻泜踶荎蝭耛箎箈筂誃竾祇謘謻貾赿趍狋軧漦迡遅遟遲邌沶歭鍉徲岻馳坘俿尺耻齿侈豉哆褫蚇胣肔袲袳裭誀欼鉹拸扡恥垑呎叺卶齒赤炽斥翅敕叱饬彳啻瘛傺眙剟腟翨翤翄糦瘈痸痓趐趩跅跮熾烾灻湁迣遫鉓銐柅杘捇抶懘憏慸慗恜雴飭饎騺呬鳷卙鵣勑勅鶒鷘"},
                new string[]{"Chong","冲充忡舂涌憧茺艟衝翀褈罿祌珫蹖浺沖樁摏憃徸嘃傭重崇虫蝩蟲緟痋爞漴隀崈宠揰寵埫喠铳蹱銃"},
                new string[]{"Chou","抽瘳犨紬篘謅眣跾犫牰醔搊愁筹绸仇酬稠畴俦惆踌雠帱薵菗裯綢絒籌詶譸讎讐诪盩皗疇畤燽躊酧醻檮椆栦懤怞雔幬嬦嚋鮘鯈儔丑瞅杻矁醜杽魗吜偢侴臭臰遚殠"},
                new string[]{"Chu","出初樗貙摴摢岀齣除锄雏厨橱滁刍躇蜍蹰蕏藸蒭蒢芻蠩耡耝篨豠趎跦犓躕櫥鉏鋤懨雛廚幮媰鶵楚储处褚础杵楮處礎璴濋檚椘処儲齭齼触畜怵矗黜憷搐绌亍俶蓫臅觕絀觸詘竐竌諔豖琡珿踀炪滀鄐歜欪槒斶敊拀閦慉埱嘼鸀儊傗"},
                new string[]{"Chua","欻歘"},
                new string[]{"Chuai","揣搋踹膪啜嘬欼"},
                new string[]{"Chuan","川穿氚巛猭釧剶船传椽遄舡舩膞篅瑏輲歂暷圌傳喘舛荈踳堾僢串钏賗玔汌鶨"},
                new string[]{"Chuang","窗疮创蔥窻窓瘡牕牎摐囪創刅床幢橦膧牀朣噇闯磢漺闖愴傸怆剙剏刱倉仺"},
                new string[]{"Chui","吹炊龡垂锤槌捶陲棰椎菙腄箠磓桘錘鎚搥顀埀圌鬌倕"},
                new string[]{"Chun","春椿蝽萅芚箺瑃輴櫄橁槆杶暙旾媋堾鰆鶞纯淳醇唇鹑莼蓴蒓脣純犉漘滣湻浱醕錞陙鯙鶉蠢萶睶賰踳惷僢偆"},
                new string[]{"Chuo","戳踔逴辍啜龊绰缀镞腏繛綽綴磭趠輟辵涰酫歠鋜錣擉鏃鑡惙婼婥娖娕嚽齪齱"},
                new string[]{"Ci","疵呲刺粢跐蠀縒趀玼嵳姕骴髊啙呰偨齹词茨辞慈瓷磁祠雌糍兹鹚茈荠薺薋萕茲胔詞礠甆珁玆濨辝辤辭鈶柌枱飺餈嬨堲垐鴜鶿鷀此泚皉鮆佌次赐伺莿蛓茦螆絘賜栨栜朿廁庛厠刾佽"},
                new string[]{"Cong","聪葱枞囱骢匆苁璁熜蔥蓯茐蟌聰聦聡繱緫篵謥瞛瑽燪焧漗樬樅楤棇暰鏦悤怱忩騘驄囪从丛琮淙藂誴碂賨賩爜灇潨潈潀漎欉樷慒悰從徖従孮婃叢"},
                new string[]{"Cou","凑辏腠楱輳湊"},
                new string[]{"Cu","粗蔍觕麁麄麆麤徂殂蔖促簇醋蹙蹴猝卒蔟酢脨縬誎瘯瘄趗趥趨踀踓踤踧蹵錯捽憱顣媨娖娕噈卆鼀"},
                new string[]{"Cuan","蹿汆撺镩竄躥鋑攛鑹攒菆襸穳欑櫕攢攅巑窜爨篡簒熶殩"},
                new string[]{"Cui","崔催摧衰榱隹缞縗磪獕漼槯鏙慛嶉墔凗璀繀皠趡熣翠萃脆粹淬啐瘁悴毳臎膵膬脺脃翆襊綷紣粋竁疩琗焠濢椊忰崒顇啛倅伜"},
                new string[]{"Cun","村皴膥竴踆澊邨墫存蹲洊拵侟忖刌寸籿吋"},
                new string[]{"Cuo","搓撮磋蹉襊瑳遳醝髊痤矬嵯瘥鹾蔖蒫虘睉躦澨鄼酂酇嵳鹺齹脞错措挫厝锉蓌莡莝縒逪棤銼錯夎剒剉"},
                new string[]{"Da","搭哒嗒褡耷答垯笚畣鎝撘墶噠咑达沓笪瘩鞑妲打靼怛跶炟荙薘荅蟽羍繨詚畗躂溚迏迖迚逹達鎉鐽憚韃呾匒剳龖龘大眔汏亣塔疸"},
                new string[]{"Dai","呆待呔獃懛傣逮歹带代戴袋贷黛岱怠埭甙殆玳迨大骀绐诒轪蔕蚮蝳艜螮襶緿紿簤詒箉貸瑇跢蹛軑軚軩瀻汏柋曃霴靆廗帶帯帒駘垈叇鴏黱侢"},
                new string[]{"Dan","单丹担儋耽亻殚箪聃郸眈瘅卩聸耼襌襜覘簞砃癉瓭躭鄲酖殫擔愖頕媅妉噡單単匰勯胆掸疸赕亶膽衴紞賧玬燀澸撣撢抌馾刐黕黮黵伔但蛋淡旦氮澹啖诞惮萏倓疍蓞蜑蟺腅觛繵訑誕窞禫譂癚贉甔狚泹沊醈柦憺憚惔霮彈帎餤饏駳髧嚪噉嘾啿啗鴠僤"},
                new string[]{"Dang","当裆铛档筜珰艡蟷襠簹當璫澢檔鐺噹儅党挡谠譡讜灙欓攩擋黨荡菪宕凼砀垱蕩蘯簜礑碭瞊盪瓽璗趤燙潒逿氹闣愓雼嵣崵婸壋圵偒"},
                new string[]{"Dao","刀叨氘道忉鱽虭舠裯釖朷魛捯岛倒导蹈捣祷菿禱禂擣搗陦隝隯嶹嶌嶋島導壔到盗稻悼纛帱焘艔衜衟翿翢絩箌稲盜瓙燾軇檤幬噵儔"},
                new string[]{"De","嘚得德锝淂棏鍀惪悳恴徳的底脦"},
                new string[]{"Dei","嘚得"},
                new string[]{"Den","扽扥"},
                new string[]{"Deng","登灯蹬噔澄瞪簦艠覴竳豋璒燈鐙嬁墱僜等戥邓凳磴嶝镫澂鄧櫈隥"},
                new string[]{"Di","低堤滴嘀提羝氐镝袛磾碮趆牴渧鍉鏑隄彽鞮奃埞啲仾迪敌笛狄荻涤嫡籴的翟觌蹢藋藡蔐蔋苖肑覿糴篴豴踧滌浟櫂樀梑敵扚靮廸頔馰髢嚁魡唙鸐儥底抵坻邸砥柢诋骶泜菧聜觝詆軧楴掋拞阺弤坘呧厎地第蒂递帝弟棣娣睇缔碲谛菂踶蔕蝃苐螮腣締諟諦禘祶眱疐甋赿珶玓蹏焍逓遞遰釱梊鉪枤杕旳摕揥慸怟弚弔嶳嵽媂墬墑墆埊坔髰鬄啇哋僀偙俤"},
                new string[]{"Dia","嗲"},
                new string[]{"Dian","滇颠巅掂癫詀癲瘨蹎槙槇敁攧巔巓嵮顚顛厧傎齻点典碘踮丶蕇蒧痶椣敟婰奌嚸點电店殿垫甸淀奠惦佃玷癜钿靛簟坫阽蜔腍磹琔澱橝橂鈿扂電頕婝壂墊驔唸"},
                new string[]{"Diao","雕刁叼貂凋鲷碉汈虭蛁矵瞗琱軺淍錭彫弴颩奝鮉鯛鳭鵰刟鼦鸼扚屌鳥鵃掉调吊钓铫铞藋蓧罀絩訋誂竨窵窎調瘹趙釣鈟銚銱鋽鑃雿弔嬥魡伄"},
                new string[]{"Die","跌爹踮蹛叠蝶碟迭谍牒喋堞鲽垤耋瓞揲蹀蜨苵艓螲臷胅耊褋褺绖絰詄諜眣疊疉趃跕跮牃泆氎殜槢楪柣曡昳鐡挕镻戜惵恎怢鞢嵽崼峌啑鮙鰈咥"},
                new string[]{"Ding","丁盯町叮仃钉疔耵酊玎虰釘靪帄奵亇顶鼎薡艼濎鐤頂嵿顁鼑定订锭腚铤碇啶萣蝊訂磸碠矴椗鋌錠掟忊飣饤"},
                new string[]{"Diu","丢铥銩颩丟"},
                new string[]{"Dong","东冬咚氡鸫夂岽菄苳蝀笗涷氭東昸徚崬崠娻埬鮗鯟鶇倲鼕董懂蕫箽諌湩揰嬞墥动洞栋冻侗峒垌硐恫胴胨腖衕絧詷狫烔迵棟挏戙霘峝姛駧騆勭動凍働"},
                new string[]{"Dou","都兜蔸篼剅瞗橷唗吺兠侸陡抖斗钭蚪鈄枓阧豆窦逗痘读荳脰竇讀瀆浢郖酘毭梪鋀斣閗闘餖饾鬥鬦鬪鬬鬭凟"},
                new string[]{"Du","都督嘟厾阇醏闍剢读独毒犊牍渎椟顿黩髑蝳裻襡襩竇讀讟豄皾贕瓄獨犢牘瀆殰櫝樚錖鑟韇韣韥頓嬻騳匵凟黷堵赌睹笃肚锗覩篤賭琽暏鍺陼帾杜度渡镀蠹妒芏荰螙蠧詫秺殬晵鍍斁靯妬剫"},
                new string[]{"Duan","端耑褍篅鍴媏剬偳短段断缎锻椴煅簖葮腶縀緞籪碫瑖躖毈斷鍛塅"},
                new string[]{"Dui","堆磓痽鎚搥鐜嵟頧塠埻垖鴭对队兑碓敦怼憝镦薱綐祋譈譵瀩瀢濻濧杸錞鐓懟憞陮隊對奪兌兊"},
                new string[]{"Dun","吨敦蹲墩蹾礅镦惇蜳獤犜燉橔撴撉鐓鐜壿墪驐噸盹趸躉顿盾炖钝遁囤沌砘楯腯腞碷踲潡逇遯鈍憞忳庉頓坉伅"},
                new string[]{"Duo","多哆掇裰咄剟茤鄲毲敪敠崜夛嚉夺铎踱度痥跿沰敚敓鐸奪喥鮵剫凙朵躲垛哚缍亸綞趓躱軃椯朶挆挅奲埵垜嚲鬌舵剁跺堕惰驮沱饳詑貀跢跥桗柮柂柁枤杕憜陊陏隓嶞尮飿嫷媠馱駄墯墮吋鵽刴"},
                new string[]{"E","屙阿婀娿妿妸俄额娥鹅峨蛾莪讹锇哦訛誐磀譌睋皒珴迗涐鈋鋨峩頟額騀囮魤鰪吪鵝鵞佮恶砈椏枙閜惡噁鄂厄饿垭锷鳄扼遏萼谔愕鹗轭腭颚噩哑呃垩阏苊蕚蘁蚅蝁覨詻諤硆砵砨砐讍豟琧軛軶湂遌遻歺歞櫮鈪鍔敋擜搹搤搕鑩戹閼阨阸悪廅崿頞峉岋屵顎餓餩娾姶堮堨堊埡魥啞啈唖咹鰐咢呝鱷卾鴳匎鶚僫偔齃齶齾"},
                new string[]{"Ei","屙阿婀娿妿妸俄额娥鹅峨蛾莪讹锇哦訛誐磀譌睋皒珴迗涐鈋鋨峩頟額騀囮魤鰪吪鵝鵞佮恶砈椏枙閜惡噁鄂厄饿垭锷鳄扼遏萼谔愕鹗轭腭颚噩哑呃垩阏苊蕚蘁蚅蝁覨詻諤硆砵砨砐讍豟琧軛軶湂遌遻歺歞櫮鈪鍔敋擜搹搤搕鑩戹閼阨阸悪廅崿頞峉岋屵顎餓餩娾姶堮堨堊埡魥啞啈唖咹鰐咢呝鱷卾鴳匎鶚僫偔齃齶齾"},
                new string[]{"En","恩蒽煾奀唔嗯峎摁"},
                new string[]{"Eng","鞥"},
                new string[]{"Er","而儿鸸鲕荋胹聏袻耏輀轜洏栭陑陾隭峏髵唲鮞咡鴯兒児侕尔耳洱饵迩珥铒薾衈趰爾邇毦栮鉺尓尒餌嬭駬二贰佴誀貮貳樲弍髶刵"},
                new string[]{"Fa","发酦發沷醱彂廢罚伐阀筏乏垡藅茷罸罰笩瞂貶疺汎橃栰撥閥姂傠法砝灋鍅佱珐蕟琺髪髮"},
                new string[]{"Fan","翻番帆藩幡蕃墦繙籓畨犿轓旛旙憣忛颿飜嬏噃鱕勫凡繁樊烦钒矾燔蹯璠泛蘩薠舩舧舤膰蠜羳襎緐籵笲礬煩瀿瀪渢氾橎釩楓棥柉杋鐇匥凣凢鷭反返犭攵払仮范犯饭贩梵畈訉範笵盕販軓軬滼汎飯飰嬔嬎婏奿"},
                new string[]{"Fang","方芳坊枋邡钫妨匚蚄祊趽牥淓鈁埅鴋房防肪鲂堏魴访仿纺舫彷昉紡訪眪眆瓬昘旊徬髣鶭倣放"},
                new string[]{"Fei","非飞菲妃扉绯霏啡蜚鲱裶緋猆渄暃靟飛飝餥婔婓馡奜騑騛鯡肥腓淝萉蜰蟦裵棐斐匪诽翡悱榧篚蕜胐胇誹朏陫费废肺沸吠芾镄痱狒剕蕡蕟襏紼笰癈費疿濷櫠橃柹杮曊昲鐨靅廢屝墢髴厞俷鼣鼥"},
                new string[]{"Fen","分芬酚纷氛吩玢棻衯翂紛訜竕砏鈖朆錀昐雰帉餴饙妢兝坟汾焚棼颁鼢蕡蒶葐蚠蚡肦羵羒豮豶獖燓燌炃濆轒橨梤枌朌鐼隫幩頒岎馚馩墳坆魵鳻黂鼖粉瞓黺份粪奋愤忿偾瀵鲼膹糞秎憤弅奮坋鱝僨"},
                new string[]{"Feng","风峰丰封锋枫疯烽蜂沣砜葑沨蘴莑蠭肨碸豊盽豐瘋琒猦犎熢炐灃鄷酆檒楓桻鋒鎽鏠靊崶峯風寷飌妦凮凬凨僼偑麷仹冯逢缝艂舽縫綘篈漨溄渢浲摓捀馮夆堸埄讽唪覂諷凤奉俸賵甮赗煈焨湗鳯鳳鴌"},
                new string[]{"Fiao","覅"},
                new string[]{"Fo","佛坲仸仏"},
                new string[]{"Fou","否缶芣缻缹炰雬妚鴀"},
                new string[]{"Fu","夫敷肤孵麸趺跗呋稃蓲荴荂膚胕衭綒紨糐粰筟砆豧璷琈玞烰邞沕鄜鈇柎旉懯怤尃娐姇妋鳺麩麬麱伕福幅弗扶服浮伏孚符氟拂芙罘涪绂俘辐蚨凫苻桴菔莩祓佛袱茯蝠匐蜉郛黻怫绋幞砩艴芾茀洑袚韨葍虙芣艀翇複罦襆襥綍絥紼紱箙箁笰稪諨癁費畗畐畉甶玸踾炥澓輻邚泭汱酻榑棴鉘鉜栿柫枹枎捊彿韍帗韛巿岪颫颰垺垘坿髴鮄鮲哹咈鳧鳬鴔鵩鶝刜冹乁乀府辅甫抚腐釜斧俯腑滏拊脯父黼簠蚥蜅盙焤輔郙酜釡椨撫捬弣頫嘸鬴俛俌副富赴负傅复付妇阜附腹赋覆馥缚赙咐讣驸蝮鲋蕧萯蚹蛗蝜袝褔覄縛緮訃詂竎秿禣祔負賦賻軵輹椱鍑鍢陚復峊媍婦婏駙報鮒鰒鳆冨偪偩"},
                new string[]{"Ga","嘎伽呷旮咖胳夹夾嘠噶轧尜钆軋釓錷尕玍尬魀"},
                new string[]{"Gai","该垓赅陔荄絯該祴豥賅賌畡郂晐隑峐姟侅改絠鎅忋盖钙概丐溉戤芥蓋葢瓂漑槪槩鈣杚摡匄匃乢"},
                new string[]{"Gan","甘柑肝干竿矸杆苷酐泔尴疳坩玕虷芉粓筸玵漧迀釬桿攼忓幹尷尶尲魐鳱凲亁乾乹赶感敢秆擀橄澉鳡衦簳篢笴稈豃皯趕扞鰔鱤仠赣淦绀旰紺詌盰贑贛灨汵檊榦骭凎倝佄"},
                new string[]{"Gang","刚钢冈纲缸肛罡岗扛杠颃罓罁綱碙矼疘犅牨釭棡鋼鎠阬頏崗岡堽堈剛冮港犺溝戆筻焹焵槓掆戇戅"},
                new string[]{"Gao","高膏皋糕篙羔睾槔臯羙睪皐滜櫜橰槹韟餻髙鷎鷱鼛搞稿镐藁杲缟槁藳菒縞筶稾稁獔澔檺槀暠鎬夰告诰郜锆誥禞祰祮鋯峼吿勂"},
                new string[]{"Ge","戈歌哥割搁鸽圪咯格胳疙屹纥仡袼肐紇謌犵牱牫滒擱鎶扢閤戨戓鴐鴚鴿隔阁革镉膈嗝鬲葛骼塥搿蛒茖臵臈裓觡詥秴諽獦猲輵滆轕櫊槅杚敋鎘挌閣愅鞈鞷韐韚頜騔嘅鮥鮯鰪呄鵅匌佮佫个舸各盖哿蓋嗰魺鲄個铬硌虼箇鉻吤"},
                new string[]{"Gei","给給"},
                new string[]{"Gen","根跟哏艮亘茛搄揯亙"},
                new string[]{"Geng","耕庚赓更羹菮羮縆緪絚絙賡畊焿浭椩掶鶊刯鹒耿埂梗哽鲠邢绠莄綆郠挭峺頸骾鯁暅恆堩亙"},
                new string[]{"Gong","工公功宫龚攻恭弓躬共觥供肱蚣觵紅糼篢碽躳杛慐愩幊宮塨髸魟厷匔匑兣龏龔巩拱汞珙廾唝輁栱銾拲鞏嗊贡羾貢贑贛熕渱"},
                new string[]{"Gou","沟勾钩佝鞲句篝缑枸袧褠緱簼軥溝鈎鉤搆抅韝冓狗苟岣笱蚼芶耉耈耇豿玽购够构垢诟觏媾彀遘茩覯訽詬購煹構撀雊姤夠坸傋"},
                new string[]{"Gu","辜孤姑菇沽估咕箍菰觚轱毂骨呱鸪蛄酤蓇苽罛篐箛笟軱軲轂泒橭鈲柧嫴嗗鮕唃唂鴣古股谷鼓钴牯罟汩诂鹘蛊瞽臌嘏鹄嗀榖馉薣蛌蠱羖縎詁穀硲盬皼皷賈焸瀔濲淈榾鈷抇扢愲尳餶夃啒鵠鶻傦鼔顾故固雇崮锢痼梏鲴牿堌稒祻棝錮怘頋崓顧鯝凅僱"},
                new string[]{"Gua","瓜刮呱括胍鸹栝苽緺諣趏踻煱焻歄銛銽铦颳騧鴰劀寡剐啩叧剮冎挂卦褂诖罫罣絓詿掛坬"},
                new string[]{"Guai","乖掴摑拐罫箉柺枴怪夬恠噲叏"},
                new string[]{"Guan","关观官棺倌鳏冠纶莞蒄萖覌観觀綸窤矝癏瘝関闗關鰥鱞管馆琯鳤舘筦痯璭躀輨錧館灌罐惯贯鹳掼盥涫瓘祼罆礶矔貫爟潅淉遦泴毌樌摜鏆鑵懽慣悺悹雚婠鱹卝鸛丱"},
                new string[]{"Guang","光咣胱桄茪硄趪珖烡炛炚炗灮輄洸銧挄姯垙僙黆侊广犷臩獷廣逛臦迋櫎撗俇"},
                new string[]{"Gui","归规龟硅圭瑰闺鲑妫皈傀邽鬶茥螝膭胿袿規竃窐瞡瓌璝珪潙郌歸櫷櫰槼槻槣椝敮摫閨雟廆帰巂嶲嬀嫢媯騩鬹鮭鳺鴂鴃佹龜亀轨鬼诡癸簋庋匦晷宄姽蛫蟡觤詭祪軌湀氿朹攱陒恑庪垝厬匭贵桂柜跪桧刿刽炔鳜炅蓕襘繪簂筀禬硊瞶瞆癐貴赽趹猤溎櫃檜槶椢昋攰撌鞼嶡鱖鱥匱劌劊"},
                new string[]{"Gun","滚辊衮鲧磙绲蔉蓘袞裷緷緄輥滾錕惃鮌鯀棍琯謴睴睔璭棞"},
                new string[]{"Guo","郭锅过涡蝈聒埚呙崞蟈矌瘑濄渦過楇鈛鍋鐹彍彉墎堝嘓啯咼国帼虢掴馘蔮膕腘聝簂漍敋摑慖幗國圀囻囶囯果裹椁猓蜾馃菓褁綶粿輠淉槨惈餜腂"},
                new string[]{"Ha","哈铪鉿妎蛤虾蝦奤"},
                new string[]{"Hai","嘿嗨咍还孩骸還郂嚡海醢胲烸酼害亥氦骇絯餀饚駭駴嗐侅"},
                new string[]{"Han","憨酣蚶鼾顸谽歛頇嫨馠魽哻佄韩含邯寒函涵晗邗焓汗虷蜬肣筨甝琀澏浛汵榦椷梒鋡韓嵅崡頜娢馯圅唅咁凾喊罕阚蔊豃浫闞嚂鬫厈汉翰旱撼焊瀚捍憾悍颔菡撖蘫莟蛿蜭螒譀睅皔猂熯澣漢淊涆釬桿銲鋎暵晥晘攼閈扞闬雗忓頷屽顄駻垾鳱鶾傼仠"},
                new string[]{"Hang","夯魧行航杭绗吭颃蚢苀絎筕笐貥迒邟斻頏妔巷沆"},
                new string[]{"Hao","蒿薅嚆薧茠豪毫壕蚝濠嚎号嗥貉號虠蠔籇竓諕譹獋獆毜椃曍噑嘷呺儫好郝浩昊镐耗皓灏颢淏翯藃薃聕秏皥皡皞皜灝澔滈鄗暭暤暠晧昦鎬悎恏顥哠鰝傐"},
                new string[]{"He","喝呵嗬诃蠚訶欱抲和河何合核盒荷禾菏阖涸颌翮阂劾盍貉辖曷纥盉饸鞨龁柇萂螛覈紇籺訸篕詥秴礉盇皬貈狢犵熆澕轄渮郃毼楁鉌敆挌鑉閡閤闔惒頜峆餄餲姀魺啝哬咊鲄鶡鹖麧齕龢赫贺鹤壑褐吓翯袔謞碋癋賀爀燺熇煂焃湼愒隺寉垎嚇嗃鶮鶴鸖佫齃"},
                new string[]{"Hei","黑嘿嗨潶黒"},
                new string[]{"Hen","痕拫鞎很狠詪佷恨"},
                new string[]{"Heng","亨哼脝涥悙衡恒横珩行蘅桁鸻胻烆橫鑅恆姮鴴佷堼啈"},
                new string[]{"Hng","横橫悙堼啈"},
                new string[]{"Hong","轰烘哄訇红薨紅硡谾焢灴輷轟渹鍧揈巆嚝叿洪宏鸿虹弘泓蕻闳荭黉竑葓葒苰舼耾翝翃羾纮綋紭紘粠篊竤硔谹谼玜玒潂渱浲浤汯鈜鉷鋐閎霐霟彋鞃屸宖娂妅垬魟呍吰厷鴻黌仜唝晎愩嗊讧訌澒澋銾撔閧闀闂鬨"},
                new string[]{"Hou","齁侯猴喉骺瘊篌糇葔腄翵翭矦睺鄇銗鍭帿餱鯸吼犼呴吽后厚候逅堠鲎郈詬豞洉後垕鮜鱟鲘"},
                new string[]{"Hu","呼乎忽唿滹糊虎戏惚烀轷虖苸膴謼軤淴淲泘歑曶昒戲戱戯恗雐雽幠寣垀嘑匫匢乊胡湖壶狐弧鹄斛槲煳瑚葫蝴核和囫醐猢鹕鹘觳蔛螜衚縠縎絗箶礐瓳瓡焀瀫沍楜鍸搰抇頶媩餬壺壷鬍嘝魱喖鰗鴩鵠鶘鶦鶮鶻唬浒琥许虍萀虝許箎滸汻錿俿乕户互沪护扈祜瓠笏怙戽岵鹱冱蔰芐綔觷簄穫護豰熩濩滬淈洿鄠槴楛枑昈鍙擭摢戸戶怘弖韄帍頀嫮嫭婟姱嚛嗀鱯鳠鳸冴鸌"},
                new string[]{"Hua","花华化哗蕐蒍蘤華芲錵嘩吪划滑骅铧猾豁螖磆譁璍獪釫鋘撶搳鏵姡驊劃鷨画话桦婳蘳舙觟繣粿話諙諣譮畵畫澅輠檴樺槬杹摦崋嬅嫿夻魤黊"},
                new string[]{"Huai","怀淮槐踝徊耲蘹褢褱瀤櫰懷懐佪坏蘾壞咶划"},
                new string[]{"Huan","欢獾讙豩貆貛犿酄歡歓欥懽懁巜孉驩嚾鴅鵍鸛环桓寰还鹮圜鬟洹缳萑锾郇澴蒝萈荁羦繯綄絙糫瞏睔豲瓛環狟轘還汍鍰鐶镮闤阛雈雚峘寏堚缓緩睆輐攌换患焕唤幻宦浣奂涣豢鲩擐痪漶逭藧肒瞣瘓瑍煥烉澣潅渙槵梙換愌嵈奐圂喛喚鯇鯶鰀"},
                new string[]{"Huang","荒慌肓晃煌塃衁朚巟黄皇湟璜潢蝗磺遑隍惶簧篁凰鳇徨蟥癀喤锽葟艎穔諻瑝趪獚熿楻鍠揘鐄韹崲媓餭墴堭騜鰉鱑鷬偟黃幌谎恍詤謊皩熀炾汻櫎晄愰怳宺奛兤皝滉洸榥曂鎤"},
                new string[]{"Hui","辉挥灰徽晖恢珲麾诙堕虺隳咴翚袆蘳翬褘詼禈睳豗琿煒煇烣灳瀈輝洃楎椲暉撝揮拻隓幑媈婎墮噕噅鰴鼿齀回茴洄蛔徊藱蚘蛕蜖繢硘痐烠迴逥恛廽廻囬囘鮰佪毁悔烜蘬螝譭燬泋毇毀檓会惠汇慧绘蕙贿卉讳彗烩秽晦恚喙荟诲浍蟪缋哕翙薉薈蔧芔翽襘繪篲詯誨穢諱譓譮瞺譿瘣賄璯璤獩燴澮潰潓滙湏沬殨櫘檜檅橞槥銊會暳鏸鐬懳憓闠阓恵徻彚彙靧廆鞼韢頮屷屶顪颒寭孈嬒餯壞圚嚖噦嘒叀匯儶僡"},
                new string[]{"Hun","婚昏荤阍蔒葷睯睧焄湣涽殙棔昬閽惽惛魂混浑馄珲繉琿轋渾梱梡揮忶顐餛餫堚鼲诨溷緄觨諢眃焝掍慁婫圂倱俒"},
                new string[]{"Huo","豁劐攉耠锪嚄穫鍃騞吙剨活和萿秳秮趏姡佸火伙灬钬漷邩鈥夥或获霍货祸惑嚯镬蠖藿蒦艧臛膕腘耯禍謋礊矐矆眓癨貨獲焃瀖濩濊湱沎檴楇曤旤擭掝捇鑊閄雘靃奯嚿魊咟俰"},
                new string[]{"Ji","基机鸡积击姬稽激矶肌饥嵇叽畸缉箕讥屐羁咭畿玑唧跻圾乩赍墼几剞芨犄齑笄丌欹蘄虀苙耭羈羇覉覊緝觭簊筓積稘諅禨磯譏譤谿賫賷璣璂踑踦躋躸毄櫅機樭槣銈枅錤敧攲擊撃鐖鑇鑙憿隮雞庴幾鞿韲嵆飢饑嘰嗘喞鳮鶏鷄刏刉鸄僟齎齏及级即吉集极急籍疾辑亟汲藉棘楫瘠佶笈嫉嵴革岌蒺戢蕺殛伋姞蹐鹡蕀蝍螏艻艥膌蠀脨耤襋覿觙級簎箿諔谻皍皀趌趞踖狤躤焏濈潗輯轚湒淁郆檝橶槉極楖銡鍓揤鏶愱忣雦雧彶霵鞊嶯岋尐塉堲叝卽卙鶺鷑偮亽亼乁己挤济脊戟麂虮纪掎鱾蟣給紀穖犱濟済泲擠撠颳妀魢丮既记继季际寄计暨冀剂技绩祭迹忌稷骥寂霁妓蓟髻伎鲫洎悸偈骑荠觊跽鲚芰彐哜垍塈檵穄罽薺薊蔇蘎葪蘮蘻萕茤茍臮蟿裚褀襀覬繼繫績縘継結紒糭計訐記誋穧穊稩禝硛瞉癠痵畟璾跡蹟瀱漈漃汥歵櫭檕梞曁暩旣旡懻懠惎際徛霽彑廭帺峜姼墍騎驥坖嚌鬾魝鮆鯚鯯鯽鰶鰿鱀鱭鵋勣劑剤兾齊齌"},
                new string[]{"Jia","家加嘉佳挟迦笳枷夹痂珈镓葭浃跏伽袈腵耞糘筴豭貑猳犌浹泇毠椵梜鉫鉿擖鎵挾拁抸宊夾埉嗧鴐麚傢戛颊荚郏蛱铗恝饸莢蛺脥袷裌猰跲郟鋏扴戞忦頬頰餄圿唊鴶鵊贾假甲钾岬胛瘕嘏斝槚賈玾檟榎鉀斚徦婽叚价架嫁驾稼骆榢幏駕駱價"},
                new string[]{"Jian","间兼坚肩监尖艰煎奸笺歼菅缄犍湔蒹鞯浅渐溅缣鹣鲣搛戋钘蕳蕑蔪葏葌虃菺艱覸纖纎縑緘籛篯箋礛碊譼睷豜監豣瑊玪猏牋熸熞瀸瀐濺漸淺殲殱櫼樫鈃椾椷銒鋻錬攕揃鐗鐧鑯閒間戔惤靬鞬幵韀韉餰姧姦馢堅囏鰔鰜鰹鳒鳽鵳鶼冿麉傔黚减柬检剪捡简碱俭拣茧翦蹇戬硷謇笕枧睑裥锏囝趼谫骞藆蠒襇襉襔襺繭絸簡詃筧礆謭瞼譾瑐瀽湕減涀醎檢橏検梘鋄暕錽鎆撿鎫揀挸戩險彅弿帴堿騫鬋鰎鹸鹹鹻鹼儉偂倹建件见健剑舰鉴践箭涧键贱荐谏腱毽踺饯槛僭牮楗薦葥艦螹臶聻袸見覵繝糋諓諫礀磵瞷瞯賎賤趝珔跈踐瀳澗轞洊檻橺釰釼榗栫旔鍊鍳鍵擶揵鏩鐱鑑鑒鑬鑳徤寋餞墹劔劒劎劍剱剣僣俴侟"},
                new string[]{"Jiang","将江姜浆疆僵缰豇礓茳鳉薑葁螀螿翞繮疅畺畕漿殭橿槳摪彊韁將壃鱂讲奖蒋桨耩膙蔣講獎顜奬奨勥傋降酱绛匠犟洚糨丬蔃袶絳糡謽滰醤醬櫤杢摾強弶弜嵹夅匞"},
                new string[]{"Jiao","交焦胶浇礁郊椒骄娇跤蕉蛟姣教茭鲛艽鹪僬峧虠茮芁膲蟭膠簥穚燋焳澆轇敎撟鐎挍憍嶣嶕嬌嫶驕骹嘐嘄鮫鷦鷮儌嚼矫矯櫵脚角缴搅绞皎剿饺铰纟狡佼侥徼敫湫挢糸蟜臫腳纐繳絞糹筊笅譑皦賋璬踋蹻煍烄灚潐湬鉸曒暞晈敿敽敥攪撹摷捁憿恔餃孂鱎鵤勦劋僥叫较觉窖轿校醮酵滘噍峤藠覐覚覺訆窌譥皭趫趭珓獥燞灂較漖轎釂斠悎嶠嬓噭嘦嘂呌"},
                new string[]{"Jie","接街皆阶揭结节疖嗟秸喈哜湝菨蝔脻袓裓結節稭謯癤痎煯椄擑掲階鞂嫅媘堦嚌喼鶛杰洁捷截劫竭碣婕诘桀颉孑睫拮羯桔讦偈鲒蓵莭蛣蜐蝍蠘蠞蠽衱袺絜紒訐詰誱礍疌趌跲踕狤潔滐迼洯櫭構榤楶楬桝鉣昅鍻擳擮搩掶鞊幯巀嶻嵥嵑崨頡岊尐媫魝鮚卪劼刼刧刦兯傑偼倢解姐觧毑檞飷媎届界借介戒价诫藉芥疥蚧骱玠蛶衸耤褯繲誡砎畍琾犗楐斺悈雃忦徣庎岕屆妎堺魪唶吤丯家傢"},
                new string[]{"Jin","金津今斤钅筋巾襟矜衿禁琎荕觔紟竻砛矝璡琻珒濜釒釿惍嶜堻埐鹶兓黅仅锦紧谨瑾堇馑廑尽槿卺蓳菫緊謹漌錦斳鏱巹嫤婜饉厪儘僅近进晋劲浸靳妗缙觐烬噤荩赆殣浕祲藎臸覲縉笒盡賮贐璶瑨燼煡濅溍進鄑歏榗枃晉搢慬寖嬧馸壗墐嚍唫勁劤凚僸侭伒齽"},
                new string[]{"Jing","经京精惊荆晶睛兢菁茎泾鲸旌粳腈猄鼱莖荊聙經経粇稉秔涇橸旍巠婛驚坙坕鯨鵛鶁麖麠仱亰景井警颈阱肼儆憬刭璟蟼穽璥璄獷燝汬汫暻擏憼幜頸宑坓剄丼竟静敬净靖竞镜境径婧胫痉陉劲靓獍弪倞葝脛竸競竫竧誩痙踁瀞濪淨迳逕浄殑梷桱曔鏡陘徑弳靘靚靜頚婙妌勁劤凈儬傹俓"},
                new string[]{"Jiong","扃蘏絅浻銄駉駫埛坰冏冋鼏炯窘迥炅蘔臩臦褧綗燛燑熲煛煚烱澃逈泂昋顈颎宭囧僒侰"},
                new string[]{"Jiu","究纠揪鸠赳啾鬏阄萛糾糺穋稵牞樛朻摎揫揂鬮鳩勼丩九酒久玖韭灸舏紤汣氿镹韮奺乣乆就旧救舅咎臼鹫疚厩柩桕僦舊畂湬殧欍柾慦廐廏廄鯦匶匛匓鷲麔倃齨蹴"},
                new string[]{"Ju","居驹鞠掬俱拘裾琚锔椐疽鞫雎据狙苴趄泃腒蜛艍臄罝諊砠眗痀跔踘涺梮鋦揟捄挶抅陱崌婮婅娵駒圧鮈鴡匊鶋凥倶俥伡局菊桔橘湨蓻蘜粷趉趜跼狊犑蹫躹焗輂淗泦郥郹毱毩檋椈閰雛巈駶驧啹鵙鵴鶪僪侷鼰鼳举咀莒矩榉沮榘柜龃踽枸蒟萭舉聥襷筥郰欅櫸椇鉏鋤擧挙弆岨齟句具剧距巨聚拒锯惧踞炬钜苣遽讵倨飓屦犋窭醵瞿菹蒩葅虡蚷螶袓耟粔簴詎窶秬豦貗珇跙爠躆焣烥澽洰邭鄒歫鉅鋸昛據鐻拠懼懅愳怚怐怇忂岠屨寠颶姖駏壉埾埧鮔勮劇冣"},
                new string[]{"Juan","捐娟涓镌鹃蠲朘脧裐瓹焆鋑鋗鎸鐫鞙姢圏鵍鵑勬勌卷锩菤臇錈捲帣巻埢埍呟绢倦鄄眷狷隽桊棬蔨萒腃羂罥襈縳絹絭讂睠睊獧淃慻惓悁雋弮韏飬餋奍奆劵"},
                new string[]{"Jue","撅噘繑撧屫屩决绝觉掘爵嚼珏厥诀攫桷角镢抉崛蹶谲蕨爝倔脚獗矍橛孓劂噱觖夬潏玦蕝虳蚗芵臄蟨蟩腳袦覐覚覺繘絶絕觼訣譎砄矡矞貜瘚疦赽璚趉瑴趹玨玃爴蹷爑熦躩焆灍逫泬決氒殌欮欔橜鈌斍鐍鐝捔挗钁镼戄憰憠彏弡嶥嶡崫孒妜駃埆髉啳鱖吷叏鴂鴃匷勪鶌刔鷢傕龣亅"},
                new string[]{"Jun","军均君钧菌筠麇龟皲莙鋆鲪蚐袀覠碅皹皸軍汮鈞桾銁銞鍕抣姰鮶麏麕龜俊骏郡峻浚隽竣狻捃焌畯蔨葰蜠箟箘珺燇濬棞晙攟攈懏陖雋寯餕馂駿埈呁鵔鵕鵘儁"},
                new string[]{"Ka","喀咔咖衉哢呿卡咯佧胩鉲"},
                new string[]{"Kai","开揩锎衉鐦開奒凯楷恺慨铠锴剀垲蒈闿輆暟鍇鎧闓愷嵦颽塏剴凱忾烗炏炌濭欬鎎愾愒噄嘅喫勓"},
                new string[]{"Kan","刊堪勘看龛戡栞嵁龕坎砍侃槛莰衎竷輡轁轗歁欿檻惂顑塪堿埳凵冚偘阚瞰墈磡矙輱闞崁"},
                new string[]{"Kang","康糠慷闶粇穅砊躿漮槺鏮閌忼嵻嫝鱇扛摃抗炕亢伉钪犺邟鈧囥匟"},
                new string[]{"Kao","尻嵪髛考烤拷栲薧洘攷丂靠铐犒稾焅槀銬鮳鯌鲓"},
                new string[]{"Ke","科颗棵柯珂磕嗑苛窠轲疴颏髁坷呵瞌稞蝌蚵屙钶牁薖萪胢窼礚砢痾趷犐軻醘樖榼鈳錒搕嵙頦顆匼壳咳翗殼殻揢嶱可渴岢磆炣毼敤嵑克课客刻恪氪骒缂溘锞袔緙課礊碦硞歁錁愙悈峇尅娔騍堁勊勀剋兡兞兛兙"},
                new string[]{"Kei","科颗棵柯珂磕嗑苛窠轲疴颏髁坷呵瞌稞蝌蚵屙钶牁薖萪胢窼礚砢痾趷犐軻醘樖榼鈳錒搕嵙頦顆匼"},
                new string[]{"Ken","肯啃垦恳肻肎豤貇錹懇墾齦龈裉褃硍珢掯"},
                new string[]{"Keng","坑吭铿硁誙硻硜牼銵鍞摼鏗揁挳阬妔奟坈劥"},
                new string[]{"Kong","空崆倥箜硿躻涳椌錓悾埪鵼孔恐控羫矼鞚"},
                new string[]{"Kou","抠眍芤瞘摳彄剾口竘劶扣寇叩蔻筘蔲簆窛瞉滱釦敂怐宼鷇冦"},
                new string[]{"Ku","哭枯窟堀骷刳矻胐窋跍郀桍朏搰扝崫圐鮬苦狜楛库裤酷喾绔齁袴褲絝秙硞瘔趶焅捁庫嚳俈"},
                new string[]{"Kua","夸舿絓誇晇恗姱垮侉銙顝咵跨挎胯骻"},
                new string[]{"Kuai","蒯擓快块筷脍哙会侩郐狯浍鲙蕢膾糩璯獪澮鄶會旝廥巜駃墤塊圦鬠鱠凷儈"},
                new string[]{"Kuan","宽髋鑧寬寛髖款窾窽歀欵梡"},
                new string[]{"Kuang","匡筐哐诓筺誆硄軭洭邼恇匩劻狂诳誑狅軖軠抂忹鵟夼爌懭儣矿况框邝旷眶圹贶纩纊絖絋穬礦砿矌眖貺軦況鄺鉱鋛曠昿鑛懬岲壙卝黋丱"},
                new string[]{"Kui","亏窥盔悝岿蘬虧聧窺闚巋顝刲奎魁葵逵夔揆暌喹睽馗蝰隗骙藈蘷虁犪躨鄈櫆楑楏晆鍨鍷戣巙頄頯騤跬傀磈蹞煃頍尯卼溃愧馈匮喟篑聩愦蒉蕢膭腃胿聵聭籄簣謉瞶瞆潰殨歸欳樻鐀鑎憒嬇媿餽饋嘳匱"},
                new string[]{"Kun","昆坤琨鲲锟醌髡焜裈菎蜫臗裩褌罤豤貇瑻猑熴潉晜錕頑崑崐尡餛婫騉堒堃髠髨鯤鵾鶤鹍捆阃悃裍綑稛稇祵硱梱閫閸壼壸困睏涃"},
                new string[]{"Kuo","扩阔廓括栝蛞葀萿筈秳煀濶漷桰擴挄拡懖闊霩彍彉鞟鞹韕頢髺噋鬠"},
                new string[]{"La","拉啦喇垃邋摺菈翋磖柆搚剌砬旯揦藞嚹辣腊蜡落瘌癞镴蝋蝲臘臈蠟癩瓎爉溂辢櫴楋攋擸揧鑞鬎鯻鱲儠鞡"},
                new string[]{"Lai","来莱涞徕崃铼梾萊箂筙琜猍淶逨郲棶錸徠庲崍顂婡騋鯠鶆麳倈俫來赖赉濑籁癞睐藾襰籟誺睞癩賚賴瀬瀨櫴攋頼唻鵣勑"},
                new string[]{"Lan","兰岚蓝栏篮拦澜阑褴斓镧婪谰襕藍葻蘭襤襴襽繿籣籃礷譋讕璼燷燣躝灡灆瀾欗欄暕斕攔鑭钄懢闌惏幱韊嵐囒厱儖懒缆览榄罱揽漤覧覽纜爦灠濫浨醂欖攬擥懶顲孏孄嬾壈滥烂蘫糷瓓爤爛爁燗煉湅壏坔嚂僋"},
                new string[]{"Lang","啷郎狼廊琅阆榔螂锒稂蓈蜋艆筤硠瑯躴郒郞欴桹鋃斏鎯閬嫏駺哴勆朗悢烺蓢脼誏樃朤朖塱俍浪蒗莨崀埌唥"},
                new string[]{"Lao","捞粩撈劳牢崂痨铹涝唠醪蟧簩窂磱癆狫澇轑浶朥鐒憦憥嶗顟髝嘮哰勞労僗老佬姥潦栳铑荖蛯耂硓珯橑銠恅鮱咾烙酪落络耢嫪耮絡躼軂橯嗠"},
                new string[]{"Le","嘞勒乐叻泐鳓仂艻簕竻砳玏牞氻樂楽扐阞忇韷鰳了"},
                new string[]{"Lei","勒雷镭累羸擂嫘缧檑蔂蘲虆罍纝纍縲礧磥畾瓃轠欙櫑樏攂鐳鑘靁壨鱩鼺磊蕾垒耒儡诔礌藟蕌蘽蠝腂絫誄礨矋讄癗瘣灅洡櫐鑸壘塁厽鸓儽傫类泪肋酹蘱纇禷祱淚涙銇錑頛頪類颣嘞"},
                new string[]{"Leng","棱塄楞薐稜碐踜輘冷愣睖堎倰"},
                new string[]{"Li","哩瓈唎离黎梨犁藜厘骊狸蠡篱漓鹂罹缡璃黧蓠丽喱蜊鲡嫠蔾蘺菞荲艃蟍蠫褵纚縭糎粚籬筣竰穲謧矖睝盠貍琍犛犂灕邌氂醨釐樆棃梸梩杝鋫錅斄鏫鑗悡離廲孷孋婯驪囄嚟鯏鯬鱺鵹劙剺剓刕鸝儷麗里李理礼澧鲤锂醴俚娌逦鳢蟸裏裡粴禮豊浬邐欚欐鋰峲峛鯉鱧利立力例莉粒历励厉栗荔吏笠隶俐沥溧郦砺砾栎莅痢傈蛎粝戾枥唳疠刂坜篥雳俪疬苈詈呖猁轹跞鬲藶蒞蒚蚸蛠茘蜧苙蝷蠇脷蠣綟糲秝禲礰礫礪磿砅讈盭皪癧癘赲瓥瓑瓅瑮珕犡爏爄躒瀝濿轢轣涖沴酈歷歴櫪櫟櫔檪棙鉝栵栛銐朸曞曆暦錑攭攦攊擽鎘搮扐慄悷悧隷隸靂靋巁岦屴娳壢塛囇嚦鬁鬴鱱鱳鳨叓厲厯厤鴗勵鷅凓儮麜"},
                new string[]{"Lia","俩倆"},
                new string[]{"Lian","连联莲廉帘涟镰怜濂鲢臁奁裢蠊薕蓮螊聯聮聫聨翴褳覝縺籨籢簾磏謰譧璉蹥燫熑濓漣溓連櫣槤梿鎌鏈鐮憐慩奩噒鬑嗹鰱匳匲劆僆亷脸琏敛蔹裣薟蘝蘞臉羷襝鄻醶歛斂摙嬚练炼链恋楝殓潋萰纞練稴瑓煉瀲澰湅浰殮錬鍊攣戀孌媡堜鰊"},
                new string[]{"Liang","梁粮良凉莨粱量椋墚踉辌蜋綡糧輬涼樑駺俍两俩冫魉蜽脼裲緉掚魎啢唡兩倆両辆亮晾谅靓倞悢諒煷輌輛湸鍄靚喨哴"},
                new string[]{"Liao","蹽撩聊辽疗寮僚燎缭潦寥嘹鹩獠僇藔蟟蟧膫膋繚簝竂窷豂療賿璙蹘爎漻遼樛暸敹镽憭憀廫嶛嶚嵺屪尞飂飉嫽髎鷯了蓼钌瞭爒鄝釕廖料撂镣尥蟉炓鐐尦"},
                new string[]{"Lie","咧裂毟櫑挘忚埓列烈劣猎洌冽趔鬣捩埒躐蛚茢脟聗綟睙獵猟犣爉爄燤煭烮迾浖棙擸挒巤巁峢颲姴奊鬛鮤哷鱲鴷劽儠"},
                new string[]{"Lin","拎淋林临琳霖麟磷邻鳞啉辚瞵粼嶙遴璘臨翷繗綝粦箖碄疄獜蹸燐瀶潾轔鄰暽晽斴鏻惏隣崊壣驎魿鱗厸冧麐檩凛廪懔菻稟癝癛澟檁撛懍廩顲凜僯亃蔺吝赁膦躏藺痳賃甐躙躪焛轥橉閵悋恡"},
                new string[]{"Ling","凌淩灵陵零玲龄菱铃羚苓泠伶绫翎聆棱酃棂瓴蛉囹鲮柃〇祾鸰蕶蔆蓤蘦舲衑袊裬綾紷詅笭竛稜秢砱皊琌跉狑爧燯軨瀮澪輘醽欞櫺鈴朎錂昤掕閝阾霊霗霛霝彾靇靈崚岺孁婈姈駖夌坽魿鯪鴒刢鹷麢倰齡齢龗岭领令嶺領另呤炩"},
                new string[]{"Liu","溜熘蹓瀏澑刘留流硫瘤浏琉骝鎏榴馏镏旒遛镠飗鹠藰蓅蒥蟉裗磂癅疁畱畄璢瑬瑠沠橊旈斿鎦鏐鐂懰嵧飀飅媹餾駠駵騮驑嚠鰡劉鶹麍柳绺锍羀罶綹珋熮橮桺桞栁鋶嬼六碌陆鹨翏磟陸雡霤廇飂塯鬸鷚"},
                new string[]{"Lo","咯"},
                new string[]{"Long","隆龙笼聋砻珑窿泷茏胧咙癃栊眬昽蕯蘢蠪蠬聾襱籠篭竜礲礱矓谾豅瓏爖躘瀧漋滝湰櫳槞朧曨鏧鑨霳靇巄巃嶐屸寵驡嚨鸗龍龒龓陇垄拢竉攏隴徿壠壟垅儱弄衖硦贚梇哢"},
                new string[]{"Lou","搂瞜摟楼娄耧偻蒌髅蝼喽窭溇蔞艛螻膢耬窶謱熡軁漊遱樓慺廔鞻屚婁髏嘍僂篓嵝簍甊嶁塿漏露陋镂瘘瘻瘺鏤"},
                new string[]{"Lu","噜撸碌漉氇謢氌擼嚕卢炉芦庐泸颅鲈胪栌垆鸬轳舻蘆艫舮臚膚蠦罏纑籚矑盧瓐璷玈獹爐瀘瀂澛轤櫨鈩枦攎鑪廬顱壚塷髗嚧魲鱸鸕黸鲁虏卤橹掳镥蓾虜艪艣磠硵滷櫓樐擄鏀捛鐪挔鑥魯鹵路陆鹿录露禄璐麓鹭潞绿逯渌赂戮辂六辘簏蓼僇甪箓蕗蔍虂菉螰膟膔翏緑綠觮觻粶籙簶簵簬穋稑祿硉睩盝賂琭趢踛蹗熝輅轆淥淕鄜醁樚椂錄録錴攄摝鏕鏴陸彔廘峍娽騄塶騼坴圥嗠鯥鱳鴼鵦鵱勠勎剹鷺侓"},
                new string[]{"Luan","栾滦銮峦鸾孪娈挛脔虊臡臠脟羉癵癴灤灓欒曫攣鑾巒孿孌奱圞圝鵉鸞卵覶乱薍釠亂乿"},
                new string[]{"Lue","掠稤略锊詻畧鋝鋢擽寽圙剠"},
                new string[]{"Lun","抡掄轮伦仑纶沦论囵菕蜦腀耣綸論磮碖踚輪淪棆錀惀陯崙崘婨圇嗧鯩倫侖溣埨"},
                new string[]{"Luo","落捋啰羅頱囉罗螺锣萝箩骡逻蜗椤猡镙脶蘿蝸腡覶覼籮玀邏欏攞鏍鑼饠騾驘鸁儸裸倮瘰蠃蓏臝砢癳躶欙曪攭鎯剆儽洛络骆摞珞雒漯荦泺烙硌跞蛒茖纙絡笿礫硦皪犖爍躒濼洜鉻捰峈駱鮥鵅"},
                new string[]{"Lv","驴闾榈藘膢氀櫚曥閭馿驢鷜吕旅屡铝履捋侣缕褛稆偻蔞膐膂褸縷絽穭穞祣焒軁郘梠鋁慺屢呂儢僂侶率绿律虑滤氯葎繂緑綠箻爈濾櫖鑢慮嵂寽寠垏哷卛勴"},
                new string[]{"Lve","掠稤略锊詻畧鋝鋢擽寽圙剠"},
                new string[]{"Ma","妈抹麻蚂摩螞孖媽吗蟆蔴蟇痳痲犘嫲嗎马玛码犸杩碼瑪獁溤遤榪鎷馬鰢鷌傌骂祃罵禡礣睰閁駡驀鬕嘛么麽"},
                new string[]{"Mai","埋霾薶貍买荬蕒買嘪鷶卖迈麦脉劢唛脈衇賣邁霡霢嘜勱麥佅"},
                new string[]{"Man","颟嫚顢瞒蛮鳗馒埋蔓谩鞔蠻謾矕瞞樠槾摱慲悗饅姏鬗鬘鰻僈满螨蟎睌滿満鏋屘曼慢漫幔缦熳墁镘蔄蟃縵獌澷澫鄤鏝"},
                new string[]{"Mang","茫牤忙芒盲氓邙硭杧蘉蛖笀硥盳痝甿狵牻浝汒釯杗朚鋩铓恾庬尨娏駹哤吂厖龍龒蟒莽漭莾茻蠎壾"},
                new string[]{"Mao","猫貓毛茅矛锚髦茆牦蝥蟊旄罞緢犛軞渵酕氂鉾枆錨嵍堥髳鶜峁卯铆泖昴蓩笷鉚戼夘冇贸茂冒貌帽懋耄瑁袤瞀眊芼萺蝐覒秏皃貿鄚鄮毷毣楙暓愗霿媢冐冃"},
                new string[]{"Me","么麽庅嚜麼"},
                new string[]{"Mei","没梅枚煤眉酶霉湄媒楣玫莓镅糜嵋鹛猸溦郿葿蘪苺腜脢脄禖矀睂瑂珻湈沒槑楳栂鋂鎇攗徾塺堳坆呅鶥黴美每镁浼羙燘渼毎鎂挴嵄嬍媺媄凂黣妹媚寐昧魅袂谜眊蝞篃祙謎睸眛痗跊煝沬氼櫗抺韎鬽"},
                new string[]{"Men","闷悶门钔扪们虋菛穈璊玧鍆捫門閅怋們亹焖懑燜滿殙暪懣悗"},
                new string[]{"Meng","蒙矇濛擝盟萌朦虻檬甍氓礞瞢艨幪獴鹲蕄莔蝱矒甿溕鄳鄸氋橗曚掹懞懜雺霚霿靀庬尨顭嫇饛夣鯍冡鸏儚鼆猛锰勐懵蠓蜢艋瓾錳鯭黽梦孟霥夢"},
                new string[]{"Mi","眯咪迷瞇谜弥糜靡醚祢麋縻猕蘼醾蒾詸穈禰謎瞴瓕獼爢瀰醿釄檷攠擟摵镾戂彌劘鸍冞麊麛米弭脒敉芈洣蔝葞羋粎眫爾灖濔渳沵銤尓尒孊侎密秘觅蜜泌汨宓谧幂嘧糸蓂藌蔤羃覓覔覛簚祕謐眽熐濗漞滵淧沕櫁樒榓鑖幦幎峚宻塓哋冪鼏"},
                new string[]{"Mian","棉眠绵缗蝒芇臱蠠緡緜綿矏矊矈櫋檰杣嬵媔婂免缅勉冕沔娩腼湎渑黾眄葂緬絻澠汅愐靦喕鮸厸勔偭俛黽丏面糆牑靣麪麫麵麺"},
                new string[]{"Miao","喵苗瞄描鹋緢嫹媌鱙鶓秒淼渺邈缈藐钞眇杪緲訬篎鈔仯庙妙缪繆竗玅廟庿"},
                new string[]{"Mie","咩乜孭哶吀灭篾蔑蠛薎衊覕眜烕瀎滅櫗搣鑖懱闑幭鱴鴓"},
                new string[]{"Min","民岷珉苠缗旻罠緡緍碈砇盿痻賯瑉琝琘玟渂鈱暋錉旼鍲捪怋忞崏姄垊鴖敏闽闵泯抿皿悯愍鳘黾蠠簢笢潣湣湏敯敃閔閩憫慜鰵呡勄刡冺僶黽"},
                new string[]{"Ming","名明鸣铭茗冥溟暝螟瞑洺蓂覭眳眀猽鄍榠銘朙嫇鳴酩慏姳凕佲命詺"},
                new string[]{"Miu","缪谬繆謬"},
                new string[]{"Mo","摸嚤摩磨膜魔模摹谟馍蘑嫫嬷麽糢謨謩譕無橅攠擵撫戂尛嬤饃饝髍嚩劘麼抹懡莫末墨默没沫漠陌殁茉蓦耱寞貉镆貘脉嘿秣瘼貊礳靺藦莈蛨艒蟔脈袹纆縸絔絈粖砞瞙瞐眿眽眜貃皌貈獏狢爅瀎沒歿歾銆枺暯昩鏌怽帞帓嫼妺塻驀圽嗼魩劰冐黙"},
                new string[]{"Mou","哞谋牟眸侔鍪缪蛑蟱繆謀瞴踎洠桙鉾敄恈鞪堥呣鴾劺麰某"},
                new string[]{"Mu","模呒毪氁墲嘸呣亩姆母牡拇姥坶茻胟砪畮畞畝畒畆踇牳鉧峔娒木穆牧目幕慕墓沐暮募睦钼仫牟苜萺莯蚞艒縸狇炑毣樢楘鉬朷慔雮霂鞪幙"},
                new string[]{"Na","那南拿镎蒘訤詉誽秅鎿挐拏哪雫乸纳娜呐钠捺衲肭蒳袦納笝豽貀軜鈉靹妠嗱魶吶內"},
                new string[]{"Nai","乃奶氖艿哪疓迺釢廼嬭妳倷奈耐鼐萘柰佴螚耏褦渿錼"},
                new string[]{"Nan","囡南难男楠喃萳莮諵畘柟枬枏暔抩難娚侽赧腩蝻煵湳揇戁嫨攤婻妠"},
                new string[]{"Nang","囔囊馕蠰涳欜搑饢嚢鬞乪攮曩灢擃崀齉儾"},
                new string[]{"Nao","孬挠呶铙蛲猱硇蝚蟯詉碙譊獿獶撓鐃憹怓巎嶩峱夒脑瑙恼垴腦碯惱嫐堖匘闹淖臑閙婥鬧"},
                new string[]{"Ne","哪讷呐那訥眲抐呢"},
                new string[]{"Nei","馁哪腇脮浽餒餧娞鮾鯘内那氝錗內"},
                new string[]{"Nen","内那氝錗內嫩恁腝嫰媆"},
                new string[]{"Neng","能竜"},
                new string[]{"Ni","妮尼泥倪霓呢铌鲵坭猊怩蚭蛪蜺臡腝觬籾秜貎跜輗淣郳棿鈮抳屔婗埿鯢兒児麑齯你拟旎薿苨聻禰狔濔沵檷鉨柅晲擬掜鑈隬孴妳馜儞儗伱逆腻溺匿昵睨伲膩胒縌誽眤痆灄迡氼暱抐懝愵惄屰孨嬺嫟堄"},
                new string[]{"Nian","拈蔫年粘黏鲶鲇秥秊姩鮎哖鯰碾撵捻辗辇簐跈蹨躎焾輦輾淰涊攆撚念廿埝艌墊唸卄"},
                new string[]{"Niang","娘酿醸釀孃"},
                new string[]{"Niao","鸟茑袅嬲蔦茮裊褭樢尦嬝嫋鳥尿脲溺"},
                new string[]{"Nie","捏揑涅聂镍孽啮蹑镊蘖颞乜嗫臬陧檗糵菍臲蠥聶糱籋篞讘痆踂踗踙躡湼櫱槷棿枿銸鋷錜敜鎳摰鑈鑷钀惗隉帇巕嶭嵲峊顳孼圼囓囐囁嚙喦齧"},
                new string[]{"Nin","您恁囜"},
                new string[]{"Ning","宁凝柠狞拧咛聍薴苧聹甯獰檸擰鑏寧寜寕寍嬣嚀鬡鬤鸋儜矃橣泞佞濘澝寗倿侫"},
                new string[]{"Niu","妞牛牜汼怓扭纽钮忸狃杻莥紐炄鈕靵拗"},
                new string[]{"Nong","农浓脓侬哝秾蕽莀膿襛穠禯癑燶濃農辳醲欁檂噥儂弄挵挊齈"},
                new string[]{"Nou","弄哝噥耨譳獳檽槈鎒搙鐞嬬"},
                new string[]{"Nu","奴驽孥砮笯駑伖努弩胬伮怒詉搙傉"},
                new string[]{"Nuan","暖煗煖湪渜餪"},
                new string[]{"Nue","疟虐硸瘧婩"},
                new string[]{"Nun","黁"},
                new string[]{"Nuo","挪傩娜郍橠梛儺诺糯喏懦锘搦耎糥糑穤稬諾蹃逽毭榒鍩搻搙掿懧愞嶿堧"},
                new string[]{"Nv","女钕籹釹衄恧衂聏沑朒"},
                new string[]{"Nve","疟虐硸瘧婩"},
                new string[]{"O","噢哦嚄"},
                new string[]{"Ou","欧鸥瓯沤殴讴区藲蓲膒筽謳甌熰漚毆醧歐櫙敺鏂慪塸吽鴎區鷗偶藕呕耦蕅腢澫嘔吘怄齵"},
                new string[]{"Pa","趴啪葩派苩舥皅妑爬耙扒筢琶杷钯跁潖鈀掱帕怕袙汃帊"},
                new string[]{"Pai","拍排牌俳徘簲簰箄猅犤輫棑迫派湃哌蒎呱渒鎃"},
                new string[]{"Pan","潘攀番扳萠眅畨乑盘磐爿蟠蹒胖般蒰螌膰褩縏磻碆盤跘蹣瀊湴洀槃柈鎜搫鞶幋媻盼判畔叛泮襻袢拚詊眫牉炍溿沜鋬鑻頖坢冸"},
                new string[]{"Pang","乓滂膀镑膖胮肨牓沗汸鎊雱霶旁庞逄磅蒡螃彷鳑舽篣趽徬嫎夆鰟厐龎龐耪覫髈嗙胖炐"},
                new string[]{"Pao","抛泡脬藨萢穮拋刨袍匏狍咆庖炮跑袌謈瓟爮炰軳鉋铇鞄颮垉麃麅疱窌礮礟砲皰犥奅嚗麭"},
                new string[]{"Pei","胚呸醅衃肧抷怌培陪赔裴锫裵賠毰錇阫婄佩配沛霈淠辔帔旆茷珮犻轡浿昢斾嶏姵馷伂"},
                new string[]{"Pen","喷濆歕噴盆湓葐衯瓫喯"},
                new string[]{"Peng","砰烹嘭怦抨澎迸胓磞硑軯漰逬泙梈閛恲駍匉鹏彭棚蓬朋篷硼膨堋蟛搒蘕莑芃蟚纄篣竼稝痭熢輣漨淜樥槰椖錋挷鑝憉弸韸韼塳塜騯髼鬅鬔鵬倗捧皏淎摓剻碰踫椪掽"},
                new string[]{"Pi","批披丕劈坯噼邳霹砒坏辟纰铍伾狉鲏耚翍紕粃秠秛礕礔磇豾狓炋釽鈈鈚鈹鉟銔枈錃錍旇鎞抷憵闢悂怶妚駓髬魾鮍伓皮疲脾啤毗芘琵埤罢枇郫蚍蜱鼙罴貔裨陴陂椑蚽蚾螕螷膍腗蠯肶羆罷篺箆笓豼痺猈焷毞毘朇阰隦崥岯壀魮匹痞癖圮否擗仳庀吡疋苉脴諀銢嶏嚭噽鴄屁僻譬睥媲甓淠澼稫睤疈潎鈲揊嫓嚊鷿"},
                new string[]{"Pian","篇偏片翩扁犏甂鍂媥囨鶣蹁骈便胼缏腁緶諚賆璸跰辯楩楄駢騈骿谝覑諞貵骗猵騗騙"},
                new string[]{"Piao","飘漂缥剽螵翲縹謤犥旚彯飃飄驫骉魒瓢朴嫖薸闝瞟殍莩蔈篻皫醥顠票嘌骠髟慓徱驃勡僄"},
                new string[]{"Pie","瞥撇氕覕潎暼撆丿苤鐅"},
                new string[]{"Pin","拼拚姘穦礗砏馪驞贫频颦嫔薲蘋蠙矉貧琕玭頻顰嬪娦嚬品榀聘牝汖"},
                new string[]{"Ping","娉乒俜艵聠砯甹涄頩平评萍凭瓶坪屏苹枰鲆冯帡洴蓱蘋蚲荓蛢胓缾簈箳評竮硑甁玶焩軿輧淜泙郱檘鉼憑慿幈帲屛馮鮃呯鵧凴"},
                new string[]{"Po","颇坡泼泊陂钋朴攴泺酦濼潑淿醱釙鏺頗岥婆鄱皤繁蔢謈櫇搫巿嘙钷叵笸鉕尀駊破魄珀迫粕蒪砶皛猼烞湐洦昢敀廹岶馞奤髆哱"},
                new string[]{"Pou","剖捊頮娝吥裒掊抔襃箁垺犃郶棓婄哣咅"},
                new string[]{"Pu","铺扑噗仆剥潽痡炇柨鋪擈撲陠巬鯆剝葡蒲璞濮脯莆匍菩镤蒱荹蜅襆襥纀穙瞨贌獛酺樸鏷捗墣圤僕普浦朴谱埔溥圃蹼氆镨諩譜烳檏暜鐠圑曝瀑暴舖"},
                new string[]{"Qi","七期妻戚漆栖欺沏凄嘁柒欹萋蹊桤缉螇緝緀紪諆碕踦迉淒郪榿棲桼朞敧攲鏚捿慽慼悽霋娸魌鵸鶈僛傶倛其奇齐棋旗骑琦祺琪祁岐崎淇脐歧祈圻畦麒耆蕲荠亓綦芪鳍骐颀萁蛴蜞俟锜埼鲯藄薺蘄萕蚑蚔蚚荎蜝艩臍蠐肵褀纃綨綥粸竒稘禥祇碁疧璂跂玂猉踑軙軝濝鄿櫀檱釮棊錡旂斊斉掑鐖懠愭忯庈嵜頎岓騎騏騹鬐鬾鬿魕鮨鯕鰭鶀剘麡齊亝起启企绮岂屺乞杞稽綮芑棨袳裿綺觭諬豈盀玘邔梩晵闙婍啟啔啓唘呇气器汽弃砌契泣迄憩碛讫葺槭汔碶芞舙蟿肐罊訖礘磩磧磜矵盵甈趞踖躤躩焏炁湇湆洓氣欫棄栔暣摖扢憇愒忔夡噐唭咠呮鼜"},
                new string[]{"Qia","掐葜袷擖揢愘拤卡跒酠峠價恰洽髂矻磍硈殎楬帢圶冾"},
                new string[]{"Qian","千签迁谦牵铅骞钎芊仟阡扦愆悭佥褰搴岍藖蚈茾臤籤簽箞竏諐謙谸牽燫熑遷汧汘欦櫏檶釺鈆鉛杄攓攑攐撁摼掔鐱挳拪鑯扡慳雃韆顅孯孅婜奷騫圲圱鬜鬝鳽厱鵮鶼鹐僉前钱乾黔潜钳虔钤掮荨犍蕁葴葥蚙荕羬箝煔軡灊濳潛歬橬榩鈐鉆鉗銭朁錢鍼揵拑扲忴靬岒媊墘騚騝鰬偂黚仱乹浅遣谴缱凵肷蜸膁脥繾譴淺槏鑓嵰唊欠倩茜嵌歉堑纤芡椠慊蔳蒨艌縴綪篟篏皘輤槧棈錎鏲悓廞嬱壍塹鰜鳒刋儙傔俔伣"},
                new string[]{"Qiang","枪腔羌锵将戗戕抢呛蜣锖镪跄羫羗謒瑲琷玱獇猐蹌蹡牄溬槍椌錆斨鎗搶鏘鏹戧嶈將嗴嗆鶬鸧强墙蔷樯嫱薔蔃蘠艢牆漒檣彊強廧嬙墻羟襁羥繦繈摤墏勥炝羻熗摪唴"},
                new string[]{"Qiao","敲锹跷悄劁橇雀硗缲繰繑礉磽磝碻趬踍蹺蹻燆郻鄡鄥毃橾鍫鍬摮鐰幧幓嵪頝墽墝塙骹勪桥乔瞧侨樵荞峤谯憔翘招蕉硚蕎藮菬荍蟜翹礄譙睄癄趫燋焳橋鐈鞒鞽嶠顦嫶墧嘺喬僑巧愀釥髜撬壳俏峭鞘窍诮箾竅誚躈殼殻撽陗鞩帩韒髚噭僺偢"},
                new string[]{"Qie","切茄伽聺癿且窃锲怯妾箧砌趄挈惬慊郄藒蛣緁篋詧笡竊穕疌踥淁洯朅鍥鐑愜悏帹嗛魥鯜鰈厒匧倢"},
                new string[]{"Qin","亲钦侵衾嵚骎菳親綅誛濅欽嶔顉寴媇駸唚鮼秦勤琴芹禽噙擒芩嗪溱檎堇廑螓覃菦蚙蠄耹矝瘽琹珡澿橬鈂鈙鈫斳捦扲懄懃慬雂忴靲嶜嫀墐埐埁鬵鳹厪鵭寝锓螼笉赺赾梫鋟昑寢寑坅沁揿吣藽菣瀙櫬鈊撳搇抋顩吢儭"},
                new string[]{"Qing","清青轻卿倾氢鲭蜻圊庼綪軽輕漀淸郬氫鑋靑靘廎寈埥鯖鶄傾情晴擎氰黥檠勍葝甠殑樈棾暒擏夝啨剠请顷苘綮謦莔請檾頃庆箐磬罄亲親碃濪渹殸掅慶凊儬"},
                new string[]{"Qiong","穷琼穹跫邛茕銎筇蛩藑藭蛬舼笻竆窮瞏睘赹瓗瓊璚琁熍煢焭焪橩桏憌惸宆嬛卭儝"},
                new string[]{"Qiu","秋邱丘湫楸鳅龟蚯萩鞧蓲蘒蝵蟗緧篍穐秌趥逎櫹橚恘鞦媝坵鰌鰍鱃鶖鹙龜龝丠求球裘囚虬遒泅巯逑俅酋仇鼽赇蝤犰訄璆虯莍蛷蠤肍觓觩絿紌訅盚皳賕玌牫煪湭渞浗汓氿毬醔殏釓釚梂銶朹捄扏巰崷鮂唒鯄鰽叴厹糗搝"},
                new string[]{"Qu","区趋屈躯驱曲祛蛆诎岖蛐黢觑焌袪胠覷組紶粬詘筁誳趍趨跙軀浀敺抾憈阹怚嶇岴岨駆駈驅坥髷魼鰸鱋區匤鶌麯麴麹佉伹渠瞿衢蕖朐劬蠼癯鸲璩磲蘧氍鼩葋菃蚼螶蟝臞蠷衐胊翵翑絇籧璖躣軥灈淭欋斪鐻鑺戵忂鮈鴝匷鸜佢取娶龋苣蝺詓竬竘跔弆齲去趣阒耝覰覻郥閴闃呿厺刞麮鼁戌"},
                new string[]{"Quan","圈悛棬腃酄鐉恮弮峑奍駩騡圏全权泉拳荃铨醛诠蜷鬈痊颧筌辁鳈葲蠸觠縓絟詮硂矔瑔跧踡狋犈牷灥輇湶洤權権銓搼闎惓巏顴孉婘姾埢啳鰁佺齤犬绻畎虇綣甽烇汱劝券牶韏勸勧"},
                new string[]{"Que","缺炔阙蒛蚗闕瘸却确雀鹊阕榷悫舃礭礐碻確碏硞皵趞獡燩毃敠搉闋慤愨隺崅墧塙埆卻鵲傕"},
                new string[]{"Qun","逡箘輑歏峮夋囷群裙麇裠羣帬宭麏麕"},
                new string[]{"Ran","然燃髯蚺蚦舑衻肰袇袡繎柟髥嘫呥冄染冉苒珃蹨熯橪媣姌"},
                new string[]{"Rang","嚷瓤穰禳镶蘘穣獽躟瀼鑲孃鬤勷儴壤攘蠰纕爙壌让譲讓懹"},
                new string[]{"Rao","饶桡娆荛蕘襓犪橈嬈饒扰擾隢绕蟯繞遶"},
                new string[]{"Re","惹若喏热熱"},
                new string[]{"Ren","人仁任壬芢秂鈓銋朲忎忈姙魜鵀忍稔荏菍荵秹涊棯栣栠认刃韧仞轫纫衽妊饪葚纴腍肕袵絍紝紉訒認祍讱牣軔釰梕杒扨靭靱韌屻飪餁刄仭"},
                new string[]{"Reng","扔仍芿礽辸陾"},
                new string[]{"Ri","日氜釰鈤馹驲囸"},
                new string[]{"Rong","茸荣容镕融蓉绒溶榕戎熔嵘狨蝾肜瑢茙螎蠑羢褣縙絨穁爃烿瀜毧榵榮曧鎔搑搈嶸嵤峵嬫嫆媶駥髶傛冗軵氄宂坈傇"},
                new string[]{"Rou","柔揉糅鞣蹂葇蝚腬粈禸瓇瑈煣輮渘楺鍒媃騥髳鰇厹鶔肉宍"},
                new string[]{"Ru","如儒茹濡孺襦铷蠕嚅薷颥臑蕠蒘袽繻筎獳燸渪邚醹桇銣曘挐鑐帤顬嬬吺鱬鴑鴽偄侞汝辱乳肗鄏擩入褥缛溽蓐洳縟媷嗕"},
                new string[]{"Rua","挼"},
                new string[]{"Ruan","软阮朊蝡腝耎緛礝碝瓀瑌燸軟輭檽愞媆偄"},
                new string[]{"Rui","蕤苼緌甤婑蕊蕋蘂蘃繠橤桵惢瑞锐睿芮蚋枘汭蜹鈉銳鋭壡叡"},
                new string[]{"Run","润闰潤橍閏閠"},
                new string[]{"Ruo","若弱箬偌蒻篛爇焫渃鄀楉婼鰙鰯叒鶸"},
                new string[]{"Sa","撒仨挲洒潵靸訯躠灑攃鞈萨卅飒脎薩蕯泧櫒鈒鎝摋鏾钑隡颯馺"},
                new string[]{"Sai","塞腮鳃噻思毸毢揌愢顋嘥鰓赛簺賽僿嗮"},
                new string[]{"San","三氵叁彡毵犙毿毶弎鬖叄厁伞馓糁散繖糤糣糝糂橵椮鏒鏾饊傪傘潵閐帴俕"},
                new string[]{"Sang","桑丧槡桒喪嗓搡颡磉褬鎟顙"},
                new string[]{"Sao","骚搔缫臊缲鳋螦繰繅縿溞鄵懆慅颾騒騷鰠鱢扫嫂掃梢瘙埽矂氉鐰髞"},
                new string[]{"Se","色瑟涩铯穑啬塞繬粣穯穡譅瘷璱琗瀒濇澁澀溹轖洓歰歮鉍栜銫鎍擌鏼拺懎闟雭廧飋嗇"},
                new string[]{"Sen","森襂篸槮椮"},
                new string[]{"Seng","僧鬙"},
                new string[]{"Sha","沙杀莎刹砂纱鲨痧煞杉铩裟挲蔱繺紗粆硰猀殺樧榝桬鎩摋挱閷魦唦鯊鯋剎啥傻儍厦霎歃唼嗄萐菨翣翜箑濈閯霅廈帹喢啑倽"},
                new string[]{"Shai","筛酾籭簛簁篩諰釃色繺晒曬攦"},
                new string[]{"Shan","山珊杉衫删姗栅煽苫跚舢埏膻钐扇潸芟蔪脠羶羴襂襳纔縿笘穇痁狦烻軕炶澘邖櫼檆釤柵銏摻搧挻幓顫姍嘇鯅鱣剼刪陕闪掺覢睒熌煔晱閃閄陝顃善汕擅单膳讪鄯嬗赡缮鳝疝骟掸禅蟮剡蟺繕訕笧禪謆磰譱贍赸灗潬樿椫敾攙撣掞鐥嶦饍墡墠騸單鱓鱔鳣儃僐傓"},
                new string[]{"Shang","商伤墒熵殇觞汤蔏螪觴禓謪漡滳湯殤慯愓塲鬺傷上赏晌垧賞贘鑜扄埫坰尚绱蠰緔恦鞝尙丄裳"},
                new string[]{"Shao","烧稍捎梢艄鞘筲蛸蕱萷莦燒焼輎旓弰韒颵娋髾鮹勺韶杓芍苕萔玿柖少绍邵哨召劭潲袑綤紹睄卲佋"},
                new string[]{"She","奢赊畲猞賒賖畬輋檨奓蛇舌折佘揲阇鞨虵蛥磼抴闍舍捨社设射涉摄慑麝赦滠拾歙厍蔎舎蠂設灄渉涻欇攝摵挕懾慴弽韘騇厙"},
                new string[]{"Shei","谁誰"},
                new string[]{"Shen","深身申伸绅莘参砷燊呻娠诜糁鲹薓蔘蓡葠裑罧罙綝紳糝籸籶訷詵穼眒甧甡珅氠柛曑敒搷扟幓峷屾嫀姺妽駪堔鯓鯵鰺叅叄參鵢兟侁神什甚鉮沈审婶哂矧谂渖覾訠諗矤瞫讅谉瀋淰邥槮棯曋抌弞頣審宷嬸魫鯅伔慎肾渗蜃胂椹葚瘆蜄腎脤祳瞋眘瘮滲涁鋠昚愼侺"},
                new string[]{"Sheng","生声升笙胜甥牲苼聲竔珄狌焺湦泩殸殅鉎枡曻昇鍟斘阩陞陹呏勝鵿鼪绳渑繩縄譝澠憴鱦省眚渻偗圣盛剩晟嵊乘蕂聖貹賸琞榺晠娍墭剰乗"},
                new string[]{"Shi","师诗施失狮湿尸虱蓍嘘酾鲺浉鸤蒒葹蝨褷襹絁籭箷詩瑡獅濕溼溮湤邿釃釶鉇鍦敆師屍噓魳鯴鰤呞鳲鳾厔鶳时十石实识食什拾蚀鲥莳饣埘炻湜鼫蒔蝕竍祏識溡辻遈榯鉐鉽時旹嵵峕實寔宲実飠姼塒囸鮖鰣鼭佦丆使史始驶屎矢豕笶痑狶鉂宩駛兘乨是市事式世士室试视氏势示似适释饰逝仕誓轼嗜柿峙侍拭噬恃舐筮谥弑礻螫贳铈奭舓褆襫視繹觢簭試秲諟諡謚睗眡眎眂貰跩狧煶烒軾澨澤遞適遰遾醳釋檡鈰鉃栻柹枾銴昰揓戺惿恀忯忕徥弒崼飭飾嬕餙餝媞馶啇咶鰘呩叓卋勢冟齛亊丗匙殖"},
                new string[]{"Shou","收敊収熟手首守艏垨受售寿瘦授兽绶狩膄綬痩獸涭醻鏉夀壽"},
                new string[]{"Shu","书输淑舒叔疏殊梳抒蔬枢菽纾倏姝摅殳疋毹俶翛綀紓疎瑹跾踈焂軗瀭輸鄃氀毺橾樞柕杸書攄掓捈陎悆忬尗鮛鵨儵倐俆熟孰赎塾秫蠋蒣蠾贖璹孎婌属署鼠蜀曙薯暑数黍薥藷蠴襡襩糬籔稌癙潻暏數屬鱪鱰鸀树术束述竖恕沭漱戍墅庶澍忄腧俞丨潏蒁虪荗術裋絉竪謶豎濖潄樹鉥朮錰鏣捒隃怷庻尌咰鶐兪侸"},
                new string[]{"Shua","刷唰选選耍誜"},
                new string[]{"Shuai","摔衰缞縗甩率帅蟀帥卛"},
                new string[]{"Shuan","拴栓闩閂涮腨槫"},
                new string[]{"Shuang","双霜孀泷艭礵瀧滝欆雙孇騻驦骦鷞鸘鹴爽縔漺樉鏯慡塽傱"},
                new string[]{"Shui","谁脽誰水氺閖税睡说裞說説稅祱涚涗捝挩帨娷"},
                new string[]{"Shun","吮楯輴顺舜瞬蕣瞤瞚眴橓順鬊"},
                new string[]{"Shuo","说說説哾朔硕烁铄槊数妁蒴搠藥箾碩矟獡爍燿洬欶數鎙鑠"},
                new string[]{"Si","斯思司丝私撕嘶锶咝厮蛳鸶澌缌厶偲飔蕬虒蜤螄螔蟖蟴罳緦絲糸簛禠禗謕磃燍泀榹楒鉰銯鋖鍶鐁愢恖廝颸媤騦噝鷉鷥凘傂俬鼶死四寺似泗驷祀俟嗣肆饲伺巳耜姒汜食兕笥涘蕼肂罒覗竢禩貄牭瀃逘洍泤釲鈶鈻梩柶銉枱杫飤飴飼孠娰駟騃儩価佁佀亖厕厠"},
                new string[]{"Song","松淞嵩菘忪凇蘴蜙硹濍檧棇梥柗枀憽憁愡庺崧娀鬆倯耸悚怂竦聳漎楤摗捒慫愯嵷駷傱送宋颂诵讼訟誦鎹頌餸"},
                new string[]{"Sou","艘搜嗖馊飕螋溲锼廋蓃蒐獀鄋醙鎪摗摉鏉捜廀颼颾餿騪叜凁叟薮擞嗾瞍藪籔櫢棷擻傁嗽瘶欶"},
                new string[]{"Su","苏酥稣窣蘇蘓穌甦櫯囌鯂卹俗素塑速诉宿粟肃溯谡僳夙涑愫缩簌嗉觫蔌蹜藗莤膆肅縮縤粛訴謖碿璛趚珟玊潥潚溸遡遬洬泝殐橚樕樎榡棴梀鋉憟愬餗嫊塐埣驌骕鱐鷫鹔傃"},
                new string[]{"Suan","酸狻痠算蒜选筭笇祘選"},
                new string[]{"Sui","虽睢濉荽眭尿葰荾芕缞縗簑熣滖浽毸挼雖鞖娞夊嗺哸倠随隋绥遂綏瓍遀陏隨髓膸瀡靃髄岁碎穗隧邃燧祟谇脺襚繸繐繀誶穟穂禭砕譢睟賥璲煫澻歲檖旞鏸鐆鐩懳韢嵗嬘埣亗"},
                new string[]{"Sun","孙荪飧狲薞蕵蓀猻槂搎飱孫喰损笋隼榫栒簨箰筍鎨損鶽"},
                new string[]{"Suo","缩梭嗦唆蓑娑睃挲莎献羧桫嗍莏縮簔簑趖獻犧摍挱髿魦鮻傞所索锁琐唢褨璅瑣溑暛鎈鎍鎖鎻鏁惢嫅嗩"},
                new string[]{"Ta","他她它塌趿溻铊踏遢褟祂牠榙鉈闧咜塔獭鳎獺溚墖鮙鰨沓榻挞蹋拓闼嗒漯阘荅誻禢譶狧躢濌澾涾逹達遝毾橽錔鎉鎑撻撘搨闒闥鞜鞳韃崉嚺嚃傝"},
                new string[]{"Tai","胎苔台珆漦孡囼咍抬邰薹鲐跆骀炱菭臺籉箈炲檯枱旲斄擡颱嬯駘坮鮐儓呔奤太泰态钛汰肽酞舦燤溙鈦態忲忕夳冭軚"},
                new string[]{"Tan","滩摊贪瘫坍啴舑癱貪痑灘潬漢攤擹怹嘽谈谭坛潭弹覃痰檀昙郯锬澹镡倓藫罎罈繵談譚譠貚醈醰橝榃曇錟鐔憛惔彈顃餤婒壜壇墵墰埮嘾鷤坦毯袒钽忐菼襢緂璮醓鉭暺憻憳嗿探叹碳炭赕舕賧湠歎撢嘆僋傝"},
                new string[]{"Tang","汤趟羰耥铴镗嘡薚蕩蘯蝪簜蹚湯鏜鐋鐺閶闛闣鞺劏鼞唐堂塘糖棠膛搪醣饧螳溏樘瑭螗鄌蓎膅糛糃篖禟磄赯踼煻漟逿橖榶鎕隚嵣餳餹饄坣啺鶶傏躺淌倘帑傥镋矘爣欓曭攩鎲钂戃儻偒黨伖烫燙漡摥"},
                new string[]{"Tao","涛掏韬焘滔绦饕叨縧縚綢絛詜謟瑫燾濤轁涭槄搯慆弢鞱幍韜飸嫍饀夲仐陶逃桃淘洮萄啕鼗绹蜪裪綯籌祹迯醄檮梼鋾錭鞀鞉駣騊咷匋讨討套"},
                new string[]{"Te","特忑慝忒铽螣蚮蟘脦貣貸犆鋱"},
                new string[]{"Tei","忒"},
                new string[]{"Teng","腾膯騰鼟藤滕疼誊螣虅縢籘籐謄痋漛邆幐駦驣鰧儯僜"},
                new string[]{"Ti","踢梯剔锑体銻擿體鵜鷈鷉提题蹄啼缇扌鹈绨醍荑鳀蕛虒苐蝭蟬褆罤緹綈穉稊諦禵禔謕磃碮瑅趧珶蹏漽渧遆桋鍗惿徲崹題媞媂姼騠嗁鮷鯷厗鴺鶗鶙鷤偍衹躰軆挮徥骵鮧替剃悌惕涕倜屉逖嚏裼俶薙褅籊詆瓋趯躍迏迖逷洟殢歒楴揥掦鐟戻惖悐弚屟屜奃髢髰嚔鬀鬄"},
                new string[]{"Tian","天添黇酟靔靝婖兲田填甜恬阗畋佃钿湉菾胋緂窴磌碵瞋盷畠甛璳沺鈿搷闐屇顚顛寘餂塡鷆鷏舔忝腆殄覥觍睓痶賟琠淟銛晪錟錪捵铦悿靦娗唺倎掭舚睼瑱"},
                new string[]{"Tiao","挑祧佻聎旫恌庣条调苕迢鲦笤髫龆蜩蓨蓧蓚萔芀螩調祒趒樤條銚鋚鎥鞗岹岧鯈鰷儵齠窕脁誂窱朓晀斢宨嬥跳眺粜艞覜絩糶頫咷"},
                new string[]{"Tie","贴帖萜聑貼跕惵怗铁蛈鉄銕鋨鐡鐵驖鴩僣餮飻呫"},
                new string[]{"Ting","听厅汀烃艼聽聼聴耓綎烴渟桯廳廰鞓庍庁厛厑停庭廷亭婷霆蜓葶莛蝏聤筳諪邒榳楟閮嵉鼮挺艇铤梃町颋珽脡誔珵烶涏鋌頲娗圢侹侱濎忊"},
                new string[]{"Tong","通嗵恫熥蓪痌炵樋囲劏同铜童桐彤佟酮潼砼瞳仝僮曈侗茼冂垌峒峂橦蚒膧絧粡詷穜秱硧眮赨獞狪犝爞燑烔浵氃鉖鉵銅朣晍庝峝餇鮦哃鲖勭偅桶统筒捅綂統筩痛恸衕憅慟"},
                new string[]{"Tou","偷鋀鍮媮婾偸头投骰亠褕緰頭透綉埱哣"},
                new string[]{"Tu","突秃凸冖葖禿痜瑹湥涋鋵捸怢嶀宊堗唋鵚鼵图涂徒途屠荼酴菟蒤莵腯筡稌瘏趃跿潳鈯梌鍎摕揬捈悇廜庩嵞峹馟駼塗圗圖図啚鵌鶟鷋鷵凃兎土吐钍汢釷圡兔堍迌鵵"},
                new string[]{"Tuan","湍褍貒猯煓圕团抟蓴糰篿漙檲槫摶鏄慱嫥塼團団鱄鶉剸剬鷒鷻疃畽墥彖褖湪"},
                new string[]{"Tui","推忒藬蓷讉焞颓蘈穨蹪橔隤頹頺頽尵墤騩魋僓腿脮聉蹆骽俀退褪蜕煺蛻螁娧駾侻"},
                new string[]{"Tun","吞暾蜳焞涒朜旽噋啍呑黗屯豚臀囤饨鲀芚臋膯豘軘忳霕庉飩坉魨氽畽褪"},
                new string[]{"Tuo","托拖脱乇棁莌脫袥託讬涶沰汑杔捝挩拕扡飥饦馲驝魠咃侻侂陀驮驼沱佗坨砣橐酡鸵柁舵跎鼍沲铊袉紽詑碢砤狏踻牠迆迱槖鉈阤陁岮馱駄駝駞堶驒鮀鱓鴕鼉鼧仛妥庹椭軃毤橢楕撱彵嫷媠鰖鵎拓唾魄箨柝蘀萚籜跅毻"},
                new string[]{"Wa","挖哇洼蛙凹娲窪窐窊穵畖漥溛攨搲徍屲媧嗗啘唲劸鼃娃姽譁瓦佤砙邷咓袜腽膃聉襪靺韈韎帓韤嗢"},
                new string[]{"Wai","歪夭竵瀤喎咼崴外顡"},
                new string[]{"Wan","湾弯剜箢豌蜿塆睕貫灣潫捥関闗關彎帵婠夘壪埦完玩丸顽烷纨芄蚖紈貦汍捖抏忨頑岏骩骪骫刓晚碗皖挽婉宛琬畹绾惋脘娩莞菀葂莬綰綩盌琓踠輓涴椀梚鋔鋺晼晩晥鍐惌夗魭唍倇万腕蔓薍萬蟃脕翫瞣贃贎澫輐鄤槾鋄錽鎫妧卐卍"},
                new string[]{"Wang","汪瀇尫尪尩尣王亡莣蚟彺兦仼亾往网枉罔惘辋魍菵蛧蝄罖罓網誷輞迬棢暀抂忹徍徃望忘旺妄盳琞迋朢"},
                new string[]{"Wei","威微危巍薇偎煨葳委萎逶隈崴溦鳂葨蜲蝛覣詴癐踒燰烓渨楲椳揻揋愄隇嶶嵔媙喴鰃鰄为维韦围唯违惟潍桅嵬帷沩涠帏闱圩囗蓶覹維觹觽觿癓琟犩爲為濰潿潙溈湋違洈鄬醀鍏撝闈恑霺幃韋峞峗寪媁圍喡鮠僞偽伟尾炜伪纬隗苇玮艉诿猥洧痿娓韪鲔薳蔿蒍葦荱蜼芛膸腲緯諉磈碨硊痏瓗瑋趡踓煒瀢濻浘沇椲梶暐鍡斖撱捤愇徫廆韑韙韡崣頠屗颹壝骩骪骫唩鮪鰖厃儰偉亹位未卫魏尉味喂谓蔚渭胃慰畏遗猬鳚藯蘶菋苿蝟螱衛衞罻褽緭謂磑硙讆讏璏猚犚熭躗躛煟軎濊轊遺錗鏏懀霨媦餧餵饖墛鮇叞"},
                new string[]{"Wen","温瘟蕴蕰辒鳁薀藴蘊褞缊縕緼豱瑥輼轀溫殟榲榅昷鎾韞塭鰛鰮文闻雯纹蚊阌亠蚉芠螡蟁聞紋瘒珳炆閺閿闅闦彣馼駇魰鳼鴍鴖鼤稳吻紊刎脗肳穩穏歾桽抆忟忞呡呚呅问汶璺揾莬舋脕絻渂搵顐妏問"},
                new string[]{"Weng","翁嗡滃鹟螉鎓鶲蓊聬瞈暡攚嵡奣塕勜瓮蕹罋甕齆"},
                new string[]{"Wo","窝涡喔倭蜗挝莴薶萵蝸窩猧踒濄渦涹撾捼堝唩我捰婑婐沃握卧渥斡幄龌肟硪嚄蒦艧臥臒腛瞃瓁踠焥濣涴楃枂捾雘媉馧偓齷仴龏"},
                new string[]{"Wu","乌屋污邬巫呜诬钨恶兀圬於螐箼誈誣窏趶烏洿鄔汚汙歍釫杇杅鎢扝扜惡弙嗚鰞鴮剭无吴吾芜毋唔梧浯蜈亡鼯蝥郚铻鹀蕪莁茣蟱禑祦譕璑珸無洖橆鋘鋙幠峿娪墲鯃呉吳鵐鷡兦俉齬亾五武午伍舞捂侮庑忤仵妩牾怃迕鹉膴碔瞴甒瑦珷玝躌熓潕逜旿摀憮陚廡嫵娬娒塢啎鵡儛倵物务误雾戊晤勿悟坞婺焐鹜芴鋈骛寤杌痦阢揾靰蘁粅窹誤矹熃溩渞沕敄扤悮悞隖忢雺霚霧霿嵨嵍岉屼奦騖噁務鶩鼿齀伆"},
                new string[]{"Xi","西希锡溪息吸熙稀夕惜兮膝奚熹析曦硒悉昔熄晰嬉淅浠羲烯郗嘻僖犀蜥歙唏牺晞汐茜醯螅翕樨舾矽栖腊蜡蹊蟋皙鼷粞菥穸裼诶窸豨饻蒠莃蜤螇脋蠵脇肹肸翖羛覀繥緆觹糦觽觿訢誒礂磎碏譆瞦睎谿豀豯貕瘜赥琋獡狶犧爔燨燍熻熺熈煕焬焟焈焁潝邜鄎氥酅欷釐橀釸榽桸暿晳錫鏭鑴扸扱憙憘惁悕恓怸隵雟忚徯徔徆巇嶲嵠屖宩餏嬆餙娭噏唽咥鱚吚厀卥鵗凞鸂傒俙席习袭媳隰檄觋薂蓆蒵莔蝷習襲覡謵趘漝郋槢椺鎴雭霫廗巂嶍飁騱騽驨喺鰼鳛鼰鼳喜洗玺禧徙铣屣葸蓰葈蟢纚縰諰謑矖瓕璽蹝躧漇歖鈢鉨鉩銑枲杫壐囍系细戏隙郄禊阋饩舄忾塈屃潟绤郤蕮蔇虩舃衋覤繫繋縘綌細稧磶盻赩趇犔熂澙滊欯欪釳鈒椞摡钑戲戱戯慀愾闟恄隟怬忥霼屭屓餼墍嚱鬩呬卌匸黖係"},
                new string[]{"Xia","虾瞎呷蝦谺煆敮颬魻鰕傄霞峡辖侠狭遐暇瑕匣狎黠硖柙蕸螛舺舝翈縖筪笚祫磍碬硤赮珨狹烚炠轄浹郃欱鍜鎋搳捾陜陿徦峽騢埉叚鶷俠下夏吓罅厦唬芐諕謑睱疜昰鎼鏬懗廈夓嚇丅"},
                new string[]{"Xian","先鲜仙掀纤暹锨酰籼氙跹莶祆锬薟蘝蘞苮脋褼襳纖纎繊縿綅秈譣珗蹮躚欦銛杴錟鍁攕搟铦憸忺廯韯韱屳孅嬐姺馦奾嘕鮮鱻鶱僲僊佡仚贤嫌咸闲弦衔娴舷痫涎鹇蔹挦藖蚿蛝臤衘胘羬絃誸稴諴礥瞷瞯盷癎癇賢贒甉澖輱湺醎銜撏閑閒憪嫻嫺婱娹嗛啣唌咞咁鷳鷴鷼鹹麙伭显险冼藓宪洗铣燹跣猃筅蚬狝蘚蜆箲禒赻玁獮獫烍灦毨櫶銑鍌攇憲險幰韅嶮崄尠尟顯县线现献限陷羡馅腺苋岘霰见莧臽臔膁脇羨缐見縣線綫綖絤糮粯誢譀硍睍県豏現獻軐軒瀗涀橌槏鋧錎晛撊鏾懢峴顈餡娨娊姭壏垷哯僴僩麲俔鼸伣"},
                new string[]{"Xiang","乡相香箱湘镶襄厢骧芗缃葙蘘薌膷纕緗瓖郷鄉鄊鄕欀鑲忀廂驤啌勷儴麘祥翔详降庠洋羏絴詳瓨跭迒栙鴹佭想响享饷飨鲞蚃蠁銄晑響餉饗饟鮝鯗鱶亯向项像象巷橡蟓萫衖缿襐稥珦潒銗曏鐌閧闀闂嶑項姠嚮鬨鱌勨"},
                new string[]{"Xiao","肖销萧霄削箫潇硝宵嚣骁枭绡逍哓消蛸枵魈鸮藃蕭萷虈虓莦蟂蟏膮蟰蠨脩翛綃簫簘窙穘謞謼硣譊睄痟痚獢獟踃猇燺燆熇焇烋灲灱瀟毊歒歊櫹橚梟銷撨撓揱憢彇庨颵宯婋驍髇髐囂嚻嘵嘐嗃呺鴞鴵鵁鷍侾崤淆洨訤誵郩殽小晓筱篠筿謏皢皛轇曉暁校笑效孝啸哮薂詨誟熽澩漻涍歗斆斅敩恔嘯嘨嘋咲効鷕傚俲"},
                new string[]{"Xie","些歇蝎楔揳蠍猲滊协鞋携斜邪谐偕勰撷胁缬挟页颉鲑湝蝢膎脋脇脅衺翓襭纈緳綊絜諧讗瑎燲熁旪鍱攜擷擕搚挾鐷拹慀愶恊鞵頁峫頡孈奊垥鬹嗋魼鮭協劦儶龤写血藛寫冩谢卸蟹械燮泄泻榭屑解懈亵薤獬契邂瀣绁廨渫躞榍塮屃澥薢蝑蠏褉缷褻觟繲緤絬絏紲糏諜禼祄謝碿爕躠焎烲炨炧灺瀉洩枻暬徢鞢韰嶰屭屧屟屓媟娎夑噧卨僁偰偞齂齘齛伳齥"},
                new string[]{"Xin","新心辛欣鑫锌馨薪芯昕忻歆莘訢盺邤鈊杺鋅惞廞嬜妡馫噷俽镡襑礥枔鐔鬵信衅囟舋脪訫焮軐炘釁憖阠庍顖孞馸伩"},
                new string[]{"Xing","星兴腥惺猩骍蛵興觪觲篂箵謃皨瑆狌煋曐嬹嫈騂垶鮏鯹型行形邢刑硎荥陉饧钘熒滎洐鈃鉶鋞铏陘巠餳娙坙侀醒省擤睲性姓杏幸悻荇婞莕臖緈涬塂倖"},
                new string[]{"Xiong","胸匈凶兄汹芎胷訩詾讻賯洶恟忷哅匂兇雄熊赨"},
                new string[]{"Xiu","修休羞庥馐咻髹鸺貅蓨銝茠臹脩脙烌烋樇鎀鏅飍饈髤鱃鵂俢宿朽滫綇糔潃秀绣袖嗅锈岫溴臭琇螑臰褎褏繡綉璓珛銹鏥鏽峀嚊齅"},
                new string[]{"Xu","需须虚圩胥墟戌嘘吁盱砉顼魆蕦蓲虗虛蝑裇繻縃緰訏窢諝謣譃谞眗疞歘歔欻欨楈晇旴揟鑐幁須頊嬃媭姁驉噓鬚魖徐蒣俆许诩栩醑糈浒蛡許詡稰諿盨珝滸湑鄦暊呴冔偦叙旭续序蓄绪煦絮恤溆婿畜酗勖洫藇藚芧聟聓續緖緒訹稸瞲瞁盢賉珬獝烼烅潊漵滀淢沀汿殈欰槒鉥銊朂昫敘敍掝慉惐怴壻垿嘼喣鱮卹勗侐伵蓿"},
                new string[]{"Xuan","宣轩萱喧煊暄揎儇谖禤瑄蕿藼蓒蘐萲蜎蝖蠉翾翧箮諠諼譞矎睻獧狟煖軒轋梋鋗晅昍鍹懁愋愃弲嬛媗駽塇咺吅璇悬玄旋漩痃蜁縣璿琁玹玆還檈暶懸嫙妶选癣暅烜癬選铉炫楦眩绚渲泫券镟碹澴蔙衒袨繏縼絢絃眴贙琄楥鉉昡鏇揈鐶镮怰鞙颴駨夐"},
                new string[]{"Xue","薛削靴蒆疶辥辪鞾韡学穴踅噱泶茓袕觷燢澩斈雤嶨峃岤學壆鴬鷽鸴乴雪鳕鱈血谑謔瞲疦趐狘瀥滈泬泧桖怴坹吷"},
                new string[]{"Xun","勋熏薰窨醺埙獯曛荤薫蘍葷臐纁矄爋燻焄姰駨壦壎塤坃嚑勳勲勛旬寻巡循荀询浔洵郇鲟恂峋绚荨栒珣蕁蟫蟳襑絢紃詢畃璕爓燖燅燂灥潯鄩毥樳桪杊攳揗廵尋噚咰鱏鱘偱侚训逊讯汛迅驯殉巽蕈浚徇噀訊訓訙稄賐狥濬迿遜殾鑂愻巺顨孫馴奞卂伨"},
                new string[]{"Ya","压鸭押丫鸦呀哑厌烏椏桠錏鐚铔閘雅庘孲壓埡圧啞唖鴉厭鴨鵪鵶鶕俹亞亜牙崖芽涯衙蚜伢岈睚玡笌疨瑘琊猚漄釾枒拁庌崕堐厓齖疋蕥瘂痖掗挜婭厊亚娅轧氩迓讶砑揠垭齾浥聐襾訝窫穵稏猰犽軋輵氬椻姶堊圠圔呾劜"},
                new string[]{"Yai","牙崖芽涯衙蚜伢岈睚玡笌疨瑘琊猚漄釾枒拁庌崕堐厓齖"},
                new string[]{"Yan","烟淹焉咽腌鄢嫣燕阉湮胭殷恹崦菸阏弇臙篶硽珚煙焑漹淊醃橪閹閼懨懕嶖嬮傿偣黫言严岩延沿盐阎炎研颜妍檐筵蜒讠闫铅芫阽蔅虤莚羨綖訁簷訮詽礹碞硏琂狿炏郔櫩楌鉛昖揅閆閻巗巖巌嵓嵒顏顔孍娮娫姸壧壛嚴喦啱厳厃鹽麙麣黬眼演衍掩偃兖琰俨剡郾魇奄鼹罨厣扊葊萒菴蝘裺褗縯甗躽渷渰遃沇酓檿椼棪曮揜抁戭愝隁隒靨巚巘嶮嵃崄屵顩媕夵噞魘鰋厴匽鶠兗儼黡黤黭黶鼴齗齞齴龂龑乵彦艳雁验堰宴砚晏焰厌焱酽谚赝滟唁谳餍葕艷艶覎觃觾諺硯讌讞豓豔贋贗猒牪爓燄熖烻灩灧灔灎溎洝酀殗醶醼釅椻曕暥敥掞彥顑嬿嬊姲饜妟墕騐騴驗驠嚥鬳喭鳫鴈厭鴳鷃鷰偐"},
                new string[]{"Yang","央秧鞅殃鸯洋泱胦眏歍鉠鍈抰锳雵霙姎鴦杨阳扬羊佯炀疡徉旸烊蛘垟玚蝆羏禓諹眻瘍瑒珜煬輰氜楊暘昜鍚敭揚鐊钖阦陽霷崸崵颺飏婸鰑鴹劷鸉养氧仰痒紻礢癢炴軮瀁氱楧柍攁懩慃岟飬養駚坱咉卬勜傟佒样漾恙怏羕詇樣様"},
                new string[]{"Yao","腰邀幺妖吆夭要么约葽約訞祅玅殀楆枖撽喓鴁姚窑瑶尧摇遥谣爻肴鳐轺繇徭陶侥珧荛峣蕘蘨窰窯磘謠謡瑤猺猶踰烑軺滧遙殽榣銚暚鎐摿搖揺铫愮恌徺嶤嶢尭顤颻飖餆餚媱堯垚嗂鰩匋鷂僥傜倄咬舀杳窈崾窅蓔苭眑狕溔榚柼抭闄岆宎婹騕鴢鷕偠齩仸药耀鹞曜钥疟靿薬藥葯艞袎覞纅詏筄窔穾矅讑瘧趯獟燿熎烄鈅曣鑰驁鼼"},
                new string[]{"Ye","耶椰掖噎倻蠮潱枒暍饐吔爷邪揶铘爺釾鋣鎁擨捓峫也野冶蠱漜壄埜嘢业叶夜页液烨晔谒邺曳腋咽靥馌葉謁礏瞸瞱皣痷瓛璍爗燁熀煠澲洂鄓鄴殗殕歋業楪枽枼曵曗曅曄鍱鎑擫擪擛擖捙鐷拽抴靨嶫嶪頁餣饁墷堨驜嚈啘鵺鸈僷偞黦亱"},
                new string[]{"Yi","一伊依衣医铱漪猗壹咿揖黟衤噫椅祎繄袆蛜褘稦禕譩瑿渏洢郼毉醫檹銥弌嬄嫛夁吚鷖鹥黳宜仪移怡沂疑彝遗夷颐贻姨诒咦饴胰嶷圯痍蛇义熙眙迤荑簃匜扅萓蛦螔衪袘耛義羠觺訑箷詒誃礙謻譺讉貤貽瓵珆跠狏狋熪熈迆迱迻遺沶釶椸椬鉇桋栘銕柂杝暆鏔拸戺恞彵彞彜彛弬巸嶬頉峓頤頥顊寲宧宐飴媐鮧鴺鸃冝儀侇乁以已乙矣倚蚁苡旖钇尾蛾舣锜苢螘艤蟻裿笖礒輢轙逘歖釔檥鈘鉯錡旑敼攺扡扆阤陭靉庡崺顗嬟鳦叆偯佁齮亿意易亦毅议益艺异译翼役溢逸忆邑疫驿谊裔轶抑奕弈懿弋峄翊佚翳屹绎羿呓刈镒翌诣肄仡熠缢挹臆癔怿蜴悒薏埸瘗艾食佾劓酏殪镱嗌乂勚廙浥螠鹝藙藝蓺蘙萟虉蛡苅芅艗膉衵肊袣耴裛羛褹襗襼繹繶縊絏訲詍詣竩穓誼秇譯議瞖睪讛豙豛豷貖瘱瘞痬賹異贀玴跇獈燱燡燚熼熤焲焬炈軼瀷澺輗潩湙辥浳浂洩泆殹殔醳醷歝欭欥檍樴槸釴榏鈠棭栺栧枻枍杙曎曀晹昳斁敡撎鎰搤掜鐿懌憶阣悥悘隿怈忔霬靾幆帠帟嶧寱孴嬑嫕饐妷墿埶垼驛坄骮圛囈鮨唈鯣呹呭勩鶂鶃劮鷁鷊鷧鷾兿鹢儗億黓俋伿齸伇亄"},
                new string[]{"Yin","因音阴殷荫茵洇姻铟喑烟氤堙湮愔蔭蒑裀緸絪筃秵禋諲磤瘖濦溵歅欭栶銦闉慇阥陰陻隂霒霠鞇韾婣駰垔骃囙噾凐侌银寅吟垠鄞淫霪夤龈狺圻嚚崟蔩荶苂螾膶蟫訔訚訡誾碒璌珢玪犾烎潯滛泿殥檭釿鈝銀斦崯峾婬圁噖唫鷣冘齗齦伒龂乑引尹饮隐瘾蚓吲靛廴蘟縯硍讔癮赺趛濥輑淾酓櫽檃鈏朄隠隱靷嶾飮飲乚印胤窨茚慭癊猌湚洕酳檼梀懚憗憖廕堷垽鮣"},
                new string[]{"Ying","英应鹰瑛婴樱莺缨璎膺嘤撄鹦莹盈罂蘡蝧蠳褮罌罃绬纓緓謍礯碤譻賏甖甇瓔瑩煐焽瀴渶櫻朠旲鍈攖鑍锳應霙韹韺孾孆嬰嫈媖嚶啨鶧鶯鷪鷹鸎鸚偀营迎赢楹蝇瀛滢萦蓥荧萤嬴荥茔潆藀萾螢蠅覮縈籯籝盁贏營熒灜瀯瀠瀅濴濚濙滎溋溁泂櫿桯攍鎣巆嵤夃塋僌俓影颖颍郢瘿穎矨癭潁浧梬摬鐛廮巊頴颕硬映媵膡譍暎鞕噟鱦"},
                new string[]{"Yo","哟唷育喲嚛"},
                new string[]{"Yong","拥庸雍墉镛邕佣壅痈慵鳙臃饔鄘癰癕牅灉澭滽郺槦銿擁鏞雝廱嫞噰嗈鱅鷛傭颙喁揘顒鰫永勇涌泳咏甬俑蛹恿踊鲬蒏筩詠禜硧踴湧栐慂愹愑惥悀彮嵱塎埇鯒勈傛用苚砽醟"},
                new string[]{"You","优忧幽悠攸呦油耰纋獶瀀滺逌泑鄾櫌懮憂怮妋嚘麀優由尤邮犹铀猷莜疣莸尢游鱿柚蚰蝣繇蝤鲉蕕蓧莤蚘肬訧秞甴猶輏輶逰遊浟邎郵沋汓楢鈾斿揂怣怞庮峳駀魷鮋冘偤有友酉莠牖黝卣铕羑蜏苃脩脜聈羗羐禉牗湵槱梄栯銪戭丣又右幼佑囿釉诱侑宥蚴鼬褎糿誘祐貁痏狖牰迶酭櫾梎銹峟孧姷唀哊亴"},
                new string[]{"Yu","淤於迂瘀纡吁虶紆箊穻盓込迃扜陓唹于余鱼逾俞渔愚虞渝榆瑜禺与隅娱馀盂愉舆萸妤嵛予腴欤臾谀竽雩揄觎舁蝓狳窬喁颙嵎玙郚蕍蘛萮茰艅螸與衧羭褕覦籅諛謣硢睮貗畭畬璵玗踰牏澞漁輿湡邘汚汙酑歶歟歈釪楰楡桙杅旟鍝扵懙悇隃雓崳顒嬩餘媮媀娯娛堬堣騟骬髃魚魣鮽鰅吳鱮鷠鸆兪齵伃亐丂雨语宇禹羽屿庾俣伛圄龉圉瘐窳妪瑀铻藇蘌萭蝺語祤貐鄅楀鋙斞斔敔挧嶼峿頨寙嫗噳匬麌傴偊俁齬玉育遇域欲愈豫裕预郁峪毓誉喻寓御狱钰浴煜聿昱谕阈驭芋鬻燠鹬尉谷粥蔚蓣饫蜮鹆熨煨菀堉彧滪燏薁蕷蓹蒮茟蜟芌艈蟈袬翑罭繘緎籲籞篽穥穀稶稢秗禦諭礜礇硲砡矞譽癒瘉琟琙獄爩燰焴軉灹灪輍澦轝淯淢逳遹醧欝欎櫲棫棜棛鈺栯銉鋊錥鐍鐭戫閼閾慾惐悆隩忬霱庽嶎預飫饇馭墺驈圫噊鬰鬱魊喩喐喅鱊叞鳿鴥鴧鴪鵒鷸鸒儥僪俼龥"},
                new string[]{"Yuan","渊冤鸢鸳眢箢嫚蜎蒬葾蜵蝝裷灁渕渆渁淵涴棩鋺惌悁弲寃嬽駌囦鳶鴛鵷剈鹓鼘鼝元原员源园袁圆缘媛援垣沅猿塬辕鼋爰芫橼螈圜湲薗蒝蚖蝯羱褑褤縁緣笎謜貟贠獂猨轅溒邍邧櫞榬榞楥杬鎱嫄媴妧騵圓園圎魭喛員厵厡鶢鶰円傆黿远薳盶逺遠院愿垸苑怨瑗掾茒衏肙裫禐願妴夗噮"},
                new string[]{"Yue","约曰約箹矱曱彠彟噦哕月越跃岳粤乐阅悦钺樾玥刖瀹钥说龠栎蘥蚎蚏臒粵籰籥籆篗說説禴礿矆趯跀爚躍躒軏汋櫟樂鈅楽鉞枂捳鑰抈閱閲戉悅恱嶽岄嬳妜髺哾鸑鸙黦"},
                new string[]{"Yun","晕氲赟辒蒕蒀蜵蝹贇熅煾煴輼轀涒氳暈頵馧奫云芸耘匀郧纭昀鋆员筠筼沄涢蕓蒷荺耺縜紜篔秐眃貟畇贠熉澐溳鄖橒愪雲妘囩員勻伝允陨殒狁愠褞磒賱玧殞鈗抎慍阭隕霣媼馻夽喗齫齳运韵蕴孕韫熨恽郓酝蕰薀藴蘊腪缊縕緼緷運鄆醖醞榅枟惲鞰韗韞韻餫傊"},
                new string[]{"Za","扎咂匝拶臜臢紮紥迊沞桚鉔帀噈魳砸杂咱襍磼沯雑雜雥韴囐囋喒偺咋"},
                new string[]{"Zai","灾栽哉甾菑睵賳烖災溨渽载仔宰崽載在再縡洅酨扗儎傤"},
                new string[]{"Zan","簪糌簮篸撍鐕鐟兂咱喒偺攒昝趱拶趲桚攢揝寁噆儹儧赞暂錾瓒襸穳禶讃讚賛贊瓚瓉蹔灒濽鄼酂酇暫鏨鏩饡囋"},
                new string[]{"Zang","脏臧赃牂蔵羘賍賘贓贜欌髒匨驵駔驡藏葬奘臟銺弉塟"},
                new string[]{"Zao","遭糟蹧醩傮凿鑿早枣藻澡蚤缲璪薻繰璅棗栆造灶躁噪皂燥唣慥簉艁竈謲譟皁趮煰梍喿唕"},
                new string[]{"Ze","泽则责择啧帻笮咋箦赜迮舴蘀萚蠌耫襗簀諎礋謮矠瞔皟責賾澤滜溭泎沢歵樍擇択幘飵嫧嘖啫唶則鸅齚齰侧昃仄稄汄昗捑庂崱夨側"},
                new string[]{"Zei","贼蠈賊戝鰂鱡鲗"},
                new string[]{"Zen","怎谮譖譛囎"},
                new string[]{"Zeng","增曾憎罾锃缯繒縡磳譄矰璔熷鄫橧鋥曽増赠甑综綜贈"},
                new string[]{"Zha","扎渣查喳楂揸咋吒哳溠蹅觰紮紥箚譇皻皶樝柤摣挓抯囃劄偧齄齇闸轧札铡炸喋蚻耫箑譗甴牐煠軋潳鍘閘霅鞢剳眨砟拃鲊苲踷搩鮓鮺鲝厏乍榨诈栅柞咤蜡蚱痄詐灹醡柵搾宱奓喥冊齰馇餷"},
                new string[]{"Zhai","摘斋侧榸斎捚夈側齋亝翟宅择檡擇窄鉙抧厏寨债砦祭责瘵責骴債"},
                new string[]{"Zhan","詹沾粘瞻毡谵占旃薝蛅覱詀譫趈邅氊氈栴枬旜閚惉怗霑嶦飦餰饘驙噡魙鱣鳣鸇鹯點展盏斩崭辗栈搌拃飐盞皽琖蹍輾醆橏榐棧斬嶄嶃颭嫸黵站战蘸湛绽颤菚虥虦襢綻碊譧跕輚轏欃戰嶘嵁顫驏偡佔"},
                new string[]{"Zhang","张章彰漳璋樟獐蟑鄣嫜蔁粻遧暲慞張弡餦騿鱆傽麞长涨掌仉礃漲涱長镸鞝幥仧帐胀账仗障丈杖嶂幛瘴脹瞕瘬痮賬扙帳墇"},
                new string[]{"Zhao","招昭钊着朝嘲啁窼謿盄皽炤釗鉊鍣巶妱駋鳭鼂鼌佋找爪沼菬瑵爫赵照兆肇召罩诏棹笊肈肁羄詔箌瞾趙狣燳櫂枛曌旐垗啅鮡"},
                new string[]{"Zhe","遮蜇折嫬嗻哲辙辄谪蛰摺磔夂虴蟄袩聑襵粍籷詟謫謺砓矺讁讋輒輙轍歽棏銸杔晣晢扸慹悊埑驝嚞喆啠鮿厇鷙乛者赭锗褶禇鍺这浙柘蔗鹧蟅潪淛這樜鷓着著招"},
                new string[]{"Zhei","这這"},
                new string[]{"Zhen","真珍针臻贞桢祯甄斟侦箴榛砧蓁镇浈胗椹溱薽蒖葴籈禛禎碪眞貞趂瑧珎獉澵潧轃湞遉酙殝針樼楨鉁桭栕枮朾錱鍖鍼鎭鎮搸靕帪寊嫃鱵偵侲鼑诊枕缜疹畛轸袗聄裖覙縥縝紾診竧稹眕軫辴沴槇昣抮弫屒姫駗鬒黰振阵震圳朕赈鸩蜄纼絼紖誫謓眹賑迧酖榐栚鋴旽敶揕挋陣陳塦鴆黮"},
                new string[]{"Zheng","争征睁铮蒸正筝怔峥挣症狰丁钲鲭烝脀聇糽篜箏睜眐癥猙踭爭炡鉦錚揁掙徵徴徰嶒崢崝媜姃埩埥鬇鮏鯖佂整拯氶晸撜掟抍愸郑政证帧诤証諍證鄭憕徎幀塣鴊"},
                new string[]{"Zhi","之只支知枝织芝汁脂肢吱祗蜘栀卮氏胝蘵菭臸胑衹衼織綕秪秖秓禵禔祬疷躓汥樲榰椥梔栺搘戠隻巵馶呮鳷鴲倁鼅直值职执植殖侄埴跖摭踯絷蹢臷蟙膱職聀縶稙秇禃贄瓡犆蹠躑軄漐淔釞樴慹嬂姪妷馽墌執坧値指纸止址旨酯祉芷趾枳徵咫黹轵夂扺沚泜茝藢蚔茋襧觝絺紙訨筫祇砋疻軹淽洔汦拞抧阯恉徴帋坁劧至制志治质致智置郅峙掷滞稚贽陟挚炙雉痣帜秩帙痔窒栉踬觯识桎蛭豸膣鸷彘轾骘忮铚庤梽滍锧薙芖螲胵袟袠翐製覟觗緻紩觶誌穉稺秷秲祑礩識眰豑豒貭瘈質疐畤瓆跱猘狾熫瀄輊潪潌滯迣遲洷歭櫛櫍楖柣銍銴杝鋕晊旘斦擿擳擲摯摨搱捗挃鑕鑦扻懫懥憄阤徝徏廌庢幟崻實寘娡駤墆騭騺驇垁鯯鴙厔劕剬鶨鷙儨傂偫"},
                new string[]{"Zhong","中忠钟终衷盅锺螽舯忪蔠蝩螤衳終籦蹱炂泈汷鈆鈡柊銿鍾鐘彸幒妐鴤刣鼨伀种肿冢踵腫穜種瘇煄歱徸尰塚喠重众仲蚛茽蟲衆衶緟筗諥祌眾狆媑妕堹偅"},
                new string[]{"Zhou","周州洲舟粥诌啁辀鸼翢諏謅矪譸诪盩皺賙赒珘烐炿輈輖淍週洀郮銂徟霌婤騆嚋喌鵃侜轴碡妯軸肘帚菷箒睭疛晭鯞胄皱骤宙昼纣咒绉籀酎繇荮薵葤縐紂粙籕籒詋詶甃椆晝駎驟噣咮呪冑僽伷"},
                new string[]{"Zhu","朱诸珠猪株铢洙诛侏茱邾蛛橥潴槠蕏藷藸蝫蠩袾絑誅諸硃豬跦瀦櫫櫧銖駯騶鮢鯺鴸劯鼄竹逐竺烛躅术筑舳瘃蠋薥蓫茿蠾篴笜笁窋爥燭炢灟逫泏欘朮曯斸敳敱钃孎鱁劚鸀主煮拄嘱渚瞩属麈褚罜詝砫矚煑濐枓陼屬宔囑驻住祝助柱铸注著杼贮蛀翥伫炷苎箸疰纻莇苧芧羜紸紵篫註築筯竚秼祩眝貯跓軴迬殶櫡樦鉒柷鋳鑄霔嵀尌飳馵駐壴坾麆佇"},
                new string[]{"Zhua","抓挝膼簻檛撾摣髽爪"},
                new string[]{"Zhuai","拽转跩轉嘬睉捙顡"},
                new string[]{"Zhuan","专砖颛蟤膞耑篿諯磚磗甎瑼漙鄟顓專嫥塼鱄叀剸转竱轉孨赚传撰篆馔啭沌蒃腞襈縳籑簨篹譔賺瑑灷饌堟囀僝僎傳"},
                new string[]{"Zhuang","庄装桩妆莊裝糚粧湷樁梉庒娤妝奘幢状壮撞僮戆獞狀焋漴戇戅壵壯"},
                new string[]{"Zhui","追锥椎隹骓箠錐騅魋鵻坠缀赘惴缒膇腏縋綴笍諈礈硾畷贅甀轛醀醊錣撱鑆隊餟娷墜倕"},
                new string[]{"Zhun","谆屯肫窀衠訰諄湻迍忳宒圫啍准綧純稕準埻凖"},
                new string[]{"Zhuo","桌捉涿拙倬焯棁蝃蠿穱穛琸炪槕棳鐯卓灼琢浊啄濯酌着斫茁镯擢诼著浞禚蓔蠗罬籱籗篧窧窡諁諑謶硺狵犳烵灂濁汋櫡椓梲鉵鋜晫斵斲斱斮斀擆撯捔鐲彴娺妰圴噣啅叕鵫劅剢鷟丵"},
                new string[]{"Zi","资兹孜滋姿淄咨孳龇趑锱吱髭辎谘仔粢鲻赀缁嵫呲觜訾嗞镃鼒薋葘菑茲茊芓緇紎訿稵秶禌諮貲資赼璾趦玆澬輜輺湽鄑椔鈭栥錙鍿鎡崰頾頿孶孖姕鯔鰦鶅齍齜子紫籽梓姊滓笫秭耔茈泚虸胏秄矷釨榟杍姉啙呰吇自字渍恣眦荢茡胾胔穧眥牸漬剚倳"},
                new string[]{"Zong","宗综棕踪鬃枞腙葼蝬艐翪繌總縂緵総緃綜稯磫豵猣踨蹤熧潨樅椶朡鍐鑁惾嵸嵕嵏騌堫騣骔鬉鬷鯮鯼倧总偬熜蓯蓗縱縦緫燪鍯摠鏓搃揔捴惣傯纵粽疭糉碂瘲猔錝昮倊"},
                new string[]{"Zou","邹诹陬驺鄹菆芻緅箃諏郰鄒棸棷掫騶鯫鲰黀齱齺走辶赱辵搊奏揍"},
                new string[]{"Zu","租菹蒩葅砠鉏錊族足卒镞綷箤稡踤踿鎐鏃崪崒顇哫卆傶倅伜组祖阻俎诅組詛謯珇爼鎺靻岨唨驵駔伹"},
                new string[]{"Zuan","钻躜躦鉆鑚鑽劗纂缵纘纉繤籫篹攥赚賺欑揝"},
                new string[]{"Zui","朘蟕脧纗樶嫢嗺厜嘴咀觜璻濢槯嶵嶊嶉噿最罪醉蕞槜絊稡祽睟辠酔酨酻欈檌檇栬鋷錊晬"},
                new string[]{"Zun","尊遵樽鳟罇繜踆鐏嶟墫鱒鷷僎撙譐噂僔"},
                new string[]{"Zuo","嘬作昨琢笮莋筰稓秨椊鈼柮捽左佐阝撮繓做座坐祚唑怍酢柞凿胙阼葃糳葄袏諎鑿岞岝飵侳咗"}
           };
        #endregion

        public static bool IsHanzi(string s)
        {
            if (string.IsNullOrEmpty(s))
                return false;

            byte[] b = Encoding.GetEncoding("GB2312").GetBytes(s.Substring(0, 1));
            if (b.Length == 1)
                return false;
            else if (b[0] >= 128 && b[0] <= 247)
                return true;
            else
                return false;
        }

        public static string GetQuanPin(string str)
        {
            string ret = "";
            string s = "";
            bool found = false;

            if (!string.IsNullOrEmpty(str))
            {
                for (int i = 0; i < str.Length; i++)
                {
                    s = str.Substring(i, 1);
                    if (IsHanzi(s))
                    {
                        found = false;
                        for (int j = 0; j < HanziArray.Length; j++)
                        {
                            if (HanziArray[j][1].IndexOf(s) != -1)
                            {
                                ret = ret + HanziArray[j][0];
                                found = true;
                                break;
                            }
                        }

                        if (!found)
                            ret = ret + s;
                    }
                    else
                    {
                        ret = ret + s;
                    }
                }
            }

            return ret;
        }

        /// <summary> 
        /// 获取拼音首字母
        /// </summary> 
        /// <param name="CnStr">汉字字符串</param> 
        /// <returns>相对应的汉语拼音首字母串</returns> 
        public static string GetCapital(string str)
        {
            string ret = "";
            string s = "";
            bool found = false;

            if (!string.IsNullOrEmpty(str))
            {
                for (int i = 0; i < str.Length; i++)
                {
                    s = str.Substring(i, 1);
                    if (IsHanzi(s))
                    {
                        found = false;
                        for (int j = 0; j < HanziArray.Length; j++)
                        {
                            if (HanziArray[j][1].IndexOf(s) != -1)
                            {
                                ret = ret + HanziArray[j][0].Substring(0, 1);
                                found = true;
                                break;
                            }
                        }

                        if (!found)
                            ret = ret + s;
                    }
                    else
                    {
                        ret = ret + s;
                    }
                }
            }

            return ret;
        }
    }
}
